nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/EepromPram.c
const u8 EepromPramLength[E2_PRAM_ID_INDEX_MAX] = 
{
	0,
	E2_TERMINAL_HEARTBEAT_LEN,			//参数ID0x0001，终端心跳发送间隔，单位秒，默认值60
	E2_TCP_ACK_OVERTIME_LEN,			//参数ID0x0002，TCP消息应答超时时间，单位秒，默认值10
	E2_TCP_RESEND_TIMES_LEN,			//参数ID0x0003，TCP消息重传次数，默认值3
	E2_UDP_ACK_OVERTIME_LEN,			//参数ID0x0004，UDP消息应答超时时间，单位秒，默认值10
	E2_UDP_RESEND_TIMES_LEN,			//参数ID0x0005，UDP消息重传次数，默认值3
	E2_SMS_ACK_OVERTIME_LEN,			//参数ID0x0006，SMS消息应答超时时间，单位秒，默认值30
	E2_SMS_RESEND_TIMES_LEN,			//参数ID0x0007，SMS消息重传次数，默认值3
	0,0,0,0,0,0,0,0,				//参数ID0x0008~0x000f，保留
	E2_MAIN_SERVER_APN_LEN,				//参数ID0x0010，主服务器APN
	E2_MAIN_SERVER_DIAL_NAME_LEN,			//参数ID0x0011，主服务器无线通信拨号用户名
	E2_MAIN_SERVER_DIAL_PASSWORD_LEN,		//参数ID0x0012，主服务器无线通信拨号密码
	E2_MAIN_SERVER_IP_LEN,				//参数ID0x0013，主服务器地址，IP或域名
	E2_BACKUP_SERVER_APN_LEN,			//参数ID0x0014，备份服务器APN，无线通信拨号访问点
	E2_BACKUP_SERVER_DIAL_NAME_LEN,			//参数ID0x0015，备份服务器无线通信拨号用户名
	E2_BACKUP_SERVER_DIAL_PASSWORD_LEN,		//参数ID0x0016，备份服务器无线通信拨号密码
	E2_BACKUP_SERVER_IP_LEN,			//参数ID0x0017，备份服务器地址，IP或域名
	E2_MAIN_SERVER_TCP_PORT_LEN,			//参数ID0x0018，主服务器TCP端口
	E2_MAIN_SERVER_UDP_PORT_LEN,			//参数ID0x0019，主服务器UDP端口
        E2_IC_MAIN_SERVER_IP_LEN,		        //参数ID0x001A, IC卡认证主服务器IP地址或域名
        E2_IC_MAIN_SERVER_TCP_PORT_LEN,		        //参数ID0x001B, IC卡认证主服务器TCP端口
        E2_IC_MAIN_SERVER_UDP_PORT_LEN,		        //参数ID0x001C, IC卡认证主服务器UDP端口
        E2_IC_BACKUP_SERVER_IP_LEN,		        //参数ID0x001D, IC卡认证备份服务器IP地址或域名
	0,0,						//参数ID0x001E~0x001f，保留
	E2_POSITION_REPORT_STRATEGY_LEN,		//参数ID0x0020，位置汇报策略
	E2_POSITION_REPORT_SCHEME_LEN,			//参数ID0x0021，位置汇报方案
	E2_DRIVER_UNLOGIN_REPORT_TIME_LEN,		//参数ID0x0022，驾驶员未登录汇报时间间隔，单位为秒，默认值为60
	0,0,0,0,					//参数ID0x0023~0x0026，保留
	E2_SLEEP_REPORT_TIME_LEN,			//参数ID0x0027，休眠时汇报时间间隔，单位为秒，默认值为60
	E2_EMERGENCY_REPORT_TIME_LEN,			//参数ID0x0028，紧急报警时汇报时间间隔，单位为秒，默认值为10
	E2_ACCON_REPORT_TIME_LEN,			//参数ID0x0029缺省时间汇报间隔,单位为秒，默认值为10
	0,0,						//参数ID0x002a~0x002b，保留
	E2_ACCON_REPORT_DISTANCE_LEN,			//参数ID0x002C缺省距离汇报间隔,单位为米,
	E2_DRIVER_UNLOGIN_REPORT_DISTANCE_LEN, 		//参数ID0x002D驾驶员未登录汇报距离间隔//单位为米//默认值为100,	
	E2_SLEEP_REPORT_DISTANCE_LEN,			//参数ID0x002e，休眠时汇报距离间隔，单位为米，默认值为1000
	E2_EMERGENCY_REPORT_DISTANCE_LEN,		//参数ID0x002f，紧急报警时汇报距离间隔，单位为米，默认值为100
	E2_CORNER_REPORT_LEN,			//参数ID0x0030，拐点补传角度,单位度/秒，默认值为15
	E2_ELECTRON_RADIUS_LEN,				//参数ID0x0031，电子围栏半径
	0,0,0,0,0,0,0,0,0,0,0,0,0,0,			//参数ID0x0031~0x003f，保留
	E2_MONITOR_SERVER_PHONE_LEN,			//参数ID0x0040，监控平台电话号码
	E2_TERMINAL_RESET_PHONE_LEN,			//参数ID0x0041，终端复位电话号码
	E2_TERMINAL_DEFAULT_SET_PHONE_LEN,		//参数ID0x0042，恢复出厂设置电话号码
	E2_MONITOR_SERVER_SMS_PHONE_LEN,		//参数ID0x0043，监控平台SMS电话号码
	E2_SMS_TEXT_ALARM_PHONE_LEN,			//参数ID0x0044，SMS文本报警电话号码
	E2_TERMINAL_GET_PHONE_STRATEGY_LEN,		//参数ID0x0045，终端电话接听策略
	E2_MAX_PHONE_TIME_EACH_LEN,			//参数ID0x0046，每次最长通话时间，单位为秒，默认为0xffffffff，不限制
	E2_MAX_PHONE_TIME_MONTH_LEN,			//参数ID0x0047，每月最长通话时间，单位为秒，默认为0xffffffff，不限制
	E2_MONITOR_PHONE_LEN,				//参数ID0x0048，监听电话号码
	E2_MONITOR_SERVER_PRIVILEGE_SMS_LEN,		//参数ID0x0049，监管平台特权短信号码
	0,0,0,0,0,0,					//参数ID0x004a~0x004f，保留
	E2_ALARM_MASK_LEN,				//参数ID0x0050，报警屏蔽字，默认为全开
	E2_ALARM_TEXT_SWITCH_LEN,			//参数ID0x0051，报警发送文本SMS开关，默认为全关
	E2_ALARM_PHOTO_SWITCH_LEN,			//参数ID0x0052，报警拍摄开关，默认为全关
	E2_ALARM_PHOTO_STORE_FLAG_LEN,			//参数ID0x0053，报警拍摄存储标志，默认为全关
	E2_KEY_FLAG_LEN,				//参数ID0x0054，关键标志
	E2_MAX_SPEED_LEN,				//参数ID0x0055，最高速度
	E2_OVER_SPEED_KEEP_TIME_LEN,			//参数ID0x0056，超速持续时间，单位为秒，默认为10秒
	E2_MAX_DRVIE_TIME_LEN,				//参数ID0x0057，连续驾驶时间门限，单位为秒，默认为240秒
	E2_MAX_DRVIE_TIME_LEN,				//参数ID0x0058，当天累计驾驶时间门限，单位为秒，默认为0
	E2_MIN_RELAX_TIME_LEN,				//参数ID0x0059，最小休息时间，单位为秒，默认为1200
	E2_MAX_STOP_CAR_TIME_LEN,			//参数ID0x005A，最长停车时间，单位为秒，默认为0
	E2_SPEED_EARLY_ALARM_DVALUE_LEN,	        //参数ID0x005B,超速报警预警差值，单位为1/10Km/h，默认为50
        E2_TIRE_EARLY_ALARM_DVALUE_LEN,		        //参数ID0x005C,疲劳驾驶预警差值，单位为秒（s），>0，默认为30
        E2_SET_CRASH_ALARM_LEN,		                //参数ID0x005D,碰撞报警参数设置 
        E2_SET_ROLLOVER_ALARM_LEN,		        //参数ID0x005E,侧翻报警参数设置：侧翻角度，单位1 度，默认为30 度
        0,0,0,0,0,                                      //参数ID0x005F~0x0063，保留
        E2_TIME_PHOTO_CONTROL_LEN,		        //参数ID0x0064,定时拍照控制
        E2_MILE_PHOTO_CONTROL_LEN,		        //参数ID0x0065,定距拍照控制
        0,0,0,0,0,0,0,0,0,0,	                        //参数ID0x0066~0x006f，保留
	E2_PICTURE_QUALITY_LEN,				//参数ID0x0070，图像/视频质量，1~10,1为最好
	E2_PICTURE_BRIGHTNESS_LEN,			//参数ID0x0071，亮度，0~255
	E2_PICTURE_CONTRAST_LEN,			//参数ID0x0072，对比度，0~127
	E2_PICTURE_SATURATION_LEN,			//参数ID0x0073，饱和度，0~127
	E2_PICTURE_CHROMA_LEN,				//参数ID0x0074，色度，0~255
	0,0,0,0,0,0,0,0,0,0,0,				//参数ID0x0075~0x007f，保留
	E2_CAR_TOTAL_MILE_LEN,				//参数ID0x0080，车辆里程表读数，0.1km
	E2_CAR_PROVINCE_ID_LEN,				//参数ID0x0081，车辆所在的省域ID
	E2_CAR_CITY_ID_LEN,				//参数ID0x0082，车辆所在的市域ID
	E2_CAR_PLATE_NUM_LEN,				//参数ID0x0083，公安交通管理部门颁发的机动车号牌
	E2_CAR_PLATE_COLOR_LEN,				//参数ID0x0084，车牌颜色，按照JT/T415-2006的5.4.12
        0,0,0,0,0,0,0,0,0,0,0,                          //参数ID0x0085~0x008f,保留
        E2_GPS_SET_MODE_LEN,		                //参数ID0x0090,GNSS 定位模式，默认为0x02 北斗定位
        E2_GPS_SET_BAUD_LEN,		                //参数ID0x0091,GNSS 波特率，默认为0x01 9600
        E2_GPS_SET_OUTPUT_RATE_LEN,		        //参数ID0x0092,GNSS 模块详细定位数据输出频率,默认为0x01 1000ms
        E2_GPS_SET_GATHER_RATE_LEN,		        //参数ID0x0093,GNSS 模块详细定位数据采集频率，单位为秒，默认为1
        E2_GPS_SET_UPLOAD_MODE_LEN,		        //参数ID0x0094,GNSS 模块详细定位数据上传方式，默认为0x00，本地存储不上传
        E2_GPS_SET_UPLOAD_VALUE_LEN,		        //参数ID0x0095,GNSS 模块详细定位数据上传设置,默认为0            
        0,0,0,0,0,0,0,0,0,0,                            //参数ID0x0096~0x009f,保留                          
        0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,                //参数ID0x00a0~0x00af,保留
        0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,                //参数ID0x00b0~0x00bf,保留
        0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,                //参数ID0x00c0~0x00cf,保留
        0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,                //参数ID0x00d0~0x00df,保留
        0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,                //参数ID0x00e0~0x00ef,保留
        0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,                //参数ID0x00f0~0x00ff,保留
        E2_CAN1_GATHER_TIME_LEN,		        //参数ID0x0100,CAN 总线通道1 采集时间间隔(ms)，0 表示不采集
        E2_CAN1_UPLOAD_TIME_LEN,		        //参数ID0x0101,CAN 总线通道1 上传时间间隔(s)，0 表示不上传
        E2_CAN2_GATHER_TIME_LEN,		        //参数ID0x0102,CAN 总线通道2 采集时间间隔(ms)，0 表示不采集
        E2_CAN2_UPLOAD_TIME_LEN,		        //参数ID0x0103,CAN 总线通道2 上传时间间隔(s)，0 表示不上传
        0,0,0,0,0,0,0,0,0,0,0,0,                        //参数ID0x0104~0x010f,保留 
        E2_CAN_SET_ONLY_GATHER_LEN,		        //参数ID0x0110,CAN 总线ID 单独采集设置BYTE[8]                
        E2_CAN_SET_ONLY_GATHER_LEN,		        //参数ID0x0110,CAN 总线ID 单独采集设置BYTE[8]                 
                 
        E2_LOGINGPRS_PASSWORD_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x00，自定义，鉴权码
	E2_REGISTER_SMS_PHONE_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x01，自定义，注册短消息号码
	E2_PROGRAM_UPDATA_REQUEST_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x02，自定义，程序升级请求标志
	E2_PROGRAM_UPDATA_VERIFYCODE_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x03，自定义，程序升级校验码
	E2_PROGRAM_UPDATA_LENGTH_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x04，自定义，程序升级长度
	E2_MANUFACTURE_LEN,				//参数IDE2_PRAM_BASE_CUSTOM_ID+0x05，自定义，制造商ID，5字节
	E2_DEVICE_ID_LEN,				//参数IDE2_PRAM_BASE_CUSTOM_ID+0x06，自定义，厂商终端ID，7字节
	E2_DEVICE_PHONE_ID_LEN,				//参数IDE2_PRAM_BASE_CUSTOM_ID+0x07，自定义，终端手机号，6字节
	E2_CAR_IDENTIFICATION_CODE_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x08，自定义，车辆识别码
	E2_CAR_TYPE_ID_LEN,				//参数IDE2_PRAM_BASE_CUSTOM_ID+0x09，自定义，车牌分类
	E2_CURRENT_DRIVER_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x0A，自定义，当前驾驶员代码
	E2_CURRENT_LICENSE_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x0B，自定义，当前驾驶证号码
	E2_FIRMWARE_VERSION_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x0C，自定义，固件版本号
	E2_ALL_DRIVER_INFORMATION_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x0D，自定义，所有驾驶员信息
	E2_SPEED_SENSOR_COEF_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x0E，自定义，速度传感器系数
	E2_CAR_FEATURE_COEF_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x0F，自定义，车辆特征系数
	E2_SPEED_SELECT_LEN,				//参数IDE2_PRAM_BASE_CUSTOM_ID+0x10，自定义，速度选择开关
	E2_BACKLIGHT_SELECT_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x11，自定义，背光选择开关
	E2_FIRST_POWERON_FLAG_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x12，自定义，系统第1次上电标志
	E2_ACC_ON_INTERVAL_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x13，自定义，ACC ON 时汇报时间间隔
	E2_ACC_ON_DISTANCE_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x14，自定义，ACC ON 时汇报距离间隔
	E2_UPDATA_LINK_CONTROL_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x15，自定义，连接控制
	E2_UPDATA_DIAL_NAME_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x16，自定义，无限升级拨号点名称
	E2_UPDATA_DIAL_USER_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x17，自定义，无限升级拨号用户名
	E2_UPDATA_DIAL_PASSWORD_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x18，自定义，无限升级拨号密码
	E2_UPDATA_IP_ID_LEN,				//参数IDE2_PRAM_BASE_CUSTOM_ID+0x19，自定义，无限升级IP地址
	E2_UPDATA_TCP_PORT_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x1a，自定义，无限升级TCP端口
	E2_UPDATA_UDP_PORT_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x1b，自定义，无限升级UDP端口
	E2_UPDATA_MONITOR_SERVER_CODE_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x1c，自定义，无限升级监管平台鉴权码
	E2_UPDATA_HARDWARE_VERSION_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x1d，自定义，无限升级硬件版本
	E2_UPDATA_FIRMWARE_VERSION_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x1e，自定义，无限升级固件版本
	E2_UPDATA_URL_ID_LEN,				//参数IDE2_PRAM_BASE_CUSTOM_ID+0x1f，自定义，无限升级URL完整地址
	E2_UPDATA_TIME_ID_LEN,				//参数IDE2_PRAM_BASE_CUSTOM_ID+0x20，自定义，无限升级连接到指定服务器时限
	E2_HOT_PHONE_ID_LEN,				//参数IDE2_PRAM_BASE_CUSTOM_ID+0x21，自定义，热线电话
	E2_UPDATA_MANUFACTURE_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x22，自定义，无限升级制造商ID
	E2_PHONE_CALLBACK_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x23，自定义，电话回拨号码
	E2_CALLBACK_FLAG_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x24，自定义，电话回拨标志,1为监听;0为普通通话
	E2_DEVICE_PHONE_BACKUP_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x25，自定义，终端手机号，备份
	E2_LAST_LOCATION_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x26，自定义，最后一个导航点位置
        E2_PHOTO_SPACE_ID_LEN,                          //参数IDE2_PRAM_BASE_CUSTOM_ID+0x27，自定义，拍照时间间隔
        E2_PHOTO_NUM_ID_LEN,                            //参数IDE2_PRAM_BASE_CUSTOM_ID+0x28，自定义，拍照张数
        E2_DOOR_SET_LEN,                                //参数IDE2_PRAM_BASE_CUSTOM_ID+0x29，自定义，车门选择，0为车门负有效，1为车门正有效
	E2_DEVICE_BACKUP_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x2a，自定义，终端ID备份
	E2_CDMA_SLEEP_ID_LEN,				//参数IDE2_PRAM_BASE_CUSTOM_ID+0x2b，自定义，CDMA休眠开关，1为开，非1为关，默认为关
	E2_PASSWORD_ID_LEN,				//参数IDE2_PRAM_BASE_CUSTOM_ID+0x2c，自定义，维护菜单进入密码
	E2_INSTALL_TIME_ID_LEN,				//参数IDE2_PRAM_BASE_CUSTOM_ID+0x2d，自定义，安装日期
	E2_INSTALL_TIME_FLAG_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x2e，自定义，安装日期写入标志
	E2_HORN_SET_ID_LEN,				//参数IDE2_PRAM_BASE_CUSTOM_ID+0x2f，自定义，车喇叭（输入）选择，1为低有效，非1为高有效。默认为高有效
	E2_GPS_CONTROL_LEN,				//参数IDE2_PRAM_BASE_CUSTOM_ID+0x30，自定义，ACC OFF时GPS模块控制,0为关,1为打开
	E2_USB_UPDATA_FLAG_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x31，自定义，USB升级标志
	E2_TAXIMETER_CONTROL_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x32，自定义，计价器功能开关,0为关闭,1为开启
	E2_TOPLIGHT_CONTROL_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x33，自定义，顶灯功能开关,0为关闭,1为开启
	E2_LEDLIGHT_CONTROL_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x34，自定义，LED广告功能开关,0为关闭,1为开启
	E2_HB_IC_DRIVER_ID_LEN,				//参数IDE2_PRAM_BASE_CUSTOM_ID+0x35，自定义，设置符合行标标准格式（0x0702指令）的驾驶员信息
	E2_STATUS_PHOTO_SWITCH_ID_LEN ,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x36，自定义，状态拍摄开关
	E2_STATUS_PHOTO_STORE_FLAG_ID_LEN, 		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x37，自定义，状态拍摄存储标志//默认为全关
	E2_RESUME_NOUSED_ID_LEN	,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x38，自定义，恢复终端为未使用状态
	E2_NIGHT_TIME0_ID_LEN,				//参数IDE2_PRAM_BASE_CUSTOM_ID+0x39，自定义，夜间时间范围,BCD码
	E2_NIGHT_MAX_DRVIE_TIME0_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x3a，自定义，夜间超时驾驶门限
	E2_NIGHT_MAX_SPEED0_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x3b，自定义，夜间限速值
	0,						//参数IDE2_PRAM_BASE_CUSTOM_ID+0x3C，自定义，V1。13补充协议VTK用作车门和SOS输入切换，VTK用，行标无此项
	0,						//参数IDE2_PRAM_BASE_CUSTOM_ID+0x3D，自定义，V1。13补充协议VTK用作自动设防启动时间，VTK用，行标无此项
	0,						//参数IDE2_PRAM_BASE_CUSTOM_ID+0x3E，自定义，V1。13补充协议VTK用作休眠时间，VTK用，行标无此项
	0,						//参数IDE2_PRAM_BASE_CUSTOM_ID+0x3F，自定义，V1。13补充协议VTK用作震动检测时间，VTK用，行标无此项
	E2_LOAD_MAX_ID_LEN,						////参数IDE2_PRAM_BASE_CUSTOM_ID+0x40，//参数ID，自定义，载重最大限制，超过该值会有超载报警，单位为kg，4字节
	E2_CAR_INIT_MILE_ID_LEN,                     //参数IDE2_PRAM_BASE_CUSTOM_ID+0x41，自定义，车辆初始化里程，DWORD
	E2_CAR_ONLY_NUM_ID_LEN,                      //参数IDE2_PRAM_BASE_CUSTOM_ID+0x42，自定义，唯一性编号，字符串，35字节
	E2_DEFINE_ALARM_MASK_WORD_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x43，自定义，自定义报警屏蔽字，DWORD
	E2_DEFINE_STATUS_CHANGE_PHOTO_ENABLE_ID_LEN,	//参数IDE2_PRAM_BASE_CUSTOM_ID+0x44，自定义，自定义状态变化拍照使能开关，DWORD
	E2_DEFINE_STATUS_CHANGE_PHOTO_STORE_ID_LEN,	//参数IDE2_PRAM_BASE_CUSTOM_ID+0x45，自定义，自定义状态变化拍照存储开关，DWORD
	0,						//参数IDE2_PRAM_BASE_CUSTOM_ID+0x46，最小弯道角度，自定义，EGS702用，EGS701无此项
	0,						//参数IDE2_PRAM_BASE_CUSTOM_ID+0x47，最大弯道角度，自定义，EGS702用，EGS701无此项
	0,						//参数IDE2_PRAM_BASE_CUSTOM_ID+0x48，弯道速度限值，自定义，EGS702用，EGS701无此项
	0,						//参数IDE2_PRAM_BASE_CUSTOM_ID+0x49，车辆初始油耗，自定义，老的EGS701用，EGS701无此项
	E2_SHUTDOWN_MODE_TIME_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x4a，自定义，关机模式时间参数，
	E2_SHUTDOWN_MODE_POWER_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x4b，自定义，深度休眠电压，
	E2_UNLOGIN_TTS_PLAY_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x4c，自定义，驾驶员未签到语音提醒，0为关，1为开。配IC卡时出货设置为开，否则设置为关
	E2_TERMINAL_TYPE_ID_LEN,                     	//参数IDE2_PRAM_BASE_CUSTOM_ID+0x4d，自定义，终端类型，北斗协议查询终端属性命令用到了这项
	E2_GPS_ATTRIBUTE_ID_LEN,                    	//参数IDE2_PRAM_BASE_CUSTOM_ID+0x4e，自定义，GNSS属性，北斗协议查询终端属性命令用到了这项
	E2_GPRS_ATTRIBUTE_ID_LEN,                   	//参数ID E2_PRAM_BASE_CUSTOM_ID+0x4f，自定义，通讯模块属性，北斗协议查询终端属性命令用到了这项
	E2_OVERSPEED_PREALARM_KEEPTIME_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x50，自定义，超速预警持续时间,DWORD,单位秒,默认值3
	E2_OVERSPEED_PREALARM_VOICE_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x51，自定义，超速预警语音,STRING,最大30字节
	E2_OVERSPEED_PREALARM_GPROUP_TIME_ID_LEN,	//参数IDE2_PRAM_BASE_CUSTOM_ID+0x52，自定义，超速预警每组提示时间间隔,DWORD,单位分钟,默认值5
	E2_OVERSPEED_PREALARM_NUMBER_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x53，自定义，超速预警每组提示次数,DWORD,默认值3
	E2_OVERSPEED_PREALARM_NUMBER_TIME_ID_LEN,	//参数IDE2_PRAM_BASE_CUSTOM_ID+0x54，自定义，超速预警每次提示时间间隔,DWORD,单位秒,默认值10
	E2_OVERSPEED_ALARM_VOICE_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x55，自定义，超速报警语音,STRING,最大30字节
	E2_OVERSPEED_ALARM_GPROUP_TIME_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x56，自定义，超速报警每组提示时间间隔,DWORD,单位分钟,默认值5
	E2_OVERSPEED_ALARM_NUMBER_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x57，自定义，超速报警每组提示次数,DWORD,默认值3
	E2_OVERSPEED_ALARM_NUMBER_TIME_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x58，自定义，超速报警每次提示时间间隔,DWORD,单位秒,默认值10
	E2_OVERSPEED_ALARM_REPORT_TIME_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x59，自定义，超速报警位置上报时间间隔,DWORD,单位秒,默认值0
	E2_OVERSPEED_NIGHT_TIME_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x5a，自定义，夜间时间,BYTE[14],作STRING处理,默认值全0
	E2_NIGHT_OVERSPEED_PERCENT_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x5b，自定义，夜间超速报警及预警百分比,DWORD,默认值80
	E2_NIGHT_DRIVE_PREALARM_TIME_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x5c，自定义，夜间行驶预警时间,,DWORD,单位分钟,默认值10
	E2_NIGHT_DRIVE_PREALARM_VOICE_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x5d，自定义，夜间行驶预警语音,STRING,最大30字节
	E2_NIGHT_DRIVE_PREALARM_GPOUP_TIME_ID_LEN,	//参数IDE2_PRAM_BASE_CUSTOM_ID+0x5e，自定义，夜间行驶预警提示时间间隔(每组),DWORD,单位分钟,默认值5
	E2_NIGHT_DRIVE_PREALARM_NUMBER_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x5f，自定义，夜间行驶预警提示次数,,DWORD,默认值3
	E2_FORBID_DRIVE_NIGHT_TIME_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x60，自定义，停车休息(禁止行驶)夜间时间,BYTE[14],作STRING处理,默认值全0
	E2_FORBID_DRIVE_PREALARM_TIME_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x61，自定义，禁行时段到达提醒提前时间,DWORD,单位分钟,默认值30
	E2_FORBID_DRIVE_PREALARM_VOICE_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x62，自定义，禁行时段到达提醒语音,STRING,最大30字节
	E2_FORBID_DRIVE_PREALARM_GPOUP_TIME_ID_LEN,	//参数IDE2_PRAM_BASE_CUSTOM_ID+0x63，自定义，禁行时段提醒时间间隔,DWORD,单位分钟,默认值5
	E2_FORBID_DRIVE_PREALARM_NUMBER_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x64，自定义，禁行时段到达提醒播报的次数,DWORD,默认值3
	E2_FORBID_DRIVE_ALARM_VOICE_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x65，自定义，禁行时段到达提醒语音,STRING,最大30字节
	E2_FORBID_DRIVE_ALARM_GPOUP_TIME_ID_LEN,	//参数IDE2_PRAM_BASE_CUSTOM_ID+0x66，自定义，禁行时段提醒时间间隔,DWORD,单位分钟,默认值5
	E2_FORBID_DRIVE_ALARM_NUMBER_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x67，自定义，禁行时段到达提醒播报的次数,DWORD,默认值3
	E2_FORBID_DRIVE_RUN_SPEED_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x68，自定义，禁行时段行驶速度,单位km/h,DWORD,默认值20
	E2_FORBID_DRIVE_RUN_SPEED_KEEPTIME_ID_LEN,	//参数IDE2_PRAM_BASE_CUSTOM_ID+0x69，自定义，禁行时段行驶速度持续时间,单位分钟,DWORD,默认值5，
	E2_TIRED_DRIVE_NIGHT_TIME_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x6a，自定义，夜间时间,BYTE[14],作STRING处理,默认值全0,夜间超时使用
	E2_NIGHT_MAX_DRVIE_TIME_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x6b，自定义，夜间连续驾驶时间门限,单位秒,DWORD,默认值7200
	E2_NIGHT_MIN_RELAX_TIME_ID_LEN,			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x6c，自定义，夜间最小休息时间,单位秒,DWORD,默认值1200
	E2_TIRED_DRIVE_ALARM_TIME_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x6d，自定义，超时驾驶报警提示语音有效时间,单位分钟,DWORD,默认值30,国标要求
	E2_TIRED_DRIVE_PREALARM_VOICE_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x6e，自定义，超时驾驶预警提示语音,STRING,最大30字节,默认值请勿超时驾驶
	E2_TIRED_DRIVE_PREALARM_GPOUP_TIME_ID_LEN,	//参数IDE2_PRAM_BASE_CUSTOM_ID+0x6f，自定义，超时驾驶预警每组提示时间间隔,单位分钟,DWORD,默认值5
	E2_TIRED_DRIVE_PREALARM_NUMBER_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x70，自定义，超时驾驶预警每组提示次数,DWORD,默认值3
	E2_TIRED_DRIVE_PREALARM_NUMBER_TIME_ID_LEN,	//参数IDE2_PRAM_BASE_CUSTOM_ID+0x71，自定义，超时驾驶预警每次提示时间间隔,单位秒,DWORD,默认值10
	E2_TIRED_DRIVE_ALARM_VOICE_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x72，自定义，超时驾驶报警提示语音,STRING,最大30字节,默认值请勿超时驾驶
	E2_TIRED_DRIVE_ALARM_GPOUP_TIME_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x73，自定义，超时驾驶报警每组提示时间间隔,单位分钟,DWORD,默认值5
	E2_TIRED_DRIVE_ALARM_NUMBER_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x74，自定义，超时驾驶报警每组提示次数,DWORD,默认值3
	E2_TIRED_DRIVE_ALARM_NUMBER_TIME_ID_LEN,	//参数IDE2_PRAM_BASE_CUSTOM_ID+0x75，自定义，超时驾驶报警每次提示时间间隔,单位秒,DWORD,默认值10
	E2_TIRED_DRIVE_REPORT_OPEN_TIME_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x76，自定义，超时驾驶报警位置上报开启时间,单位秒,DWORD,默认值0xffffffff,不开启,九通为20分钟
	E2_TIRED_DRIVE_REPORT_TIME_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x77，自定义，超时驾驶报警位置上报时间间隔,单位秒,DWORD,默认值300,九通为5分钟
	E2_TIRED_DRIVE_RUN_SPEED_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x78，自定义，超时驾驶行驶判定速度,单位km/h,DWORD,默认值5,
	E2_TIRED_DRIVE_RUN_KEEPTIME_ID_LEN,		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x79，自定义，超时驾驶行驶判定持续时间,单位秒,DWORD,默认值10,
	E2_ROUTE_EXCURSION_ALARM_NUMBER_ID_LEN,      //参数E2_PRAM_BASE_CUSTOM_ID+0x7A//参数ID，自定义，偏离线路 报警次数，0：不播报，255：持续播报 DWORD,默认值3
    	E2_ROUTE_EXCURSION_ALARM_GPOUP_TIME_ID_LEN,  //参数E2_PRAM_BASE_CUSTOM_ID+0x7B//参数ID，自定义，偏离线路报警语音时间间隔,DWORD,默认值5
    	E2_ROUTE_EXCURSION_ALARM_VOICE_ID_LEN,       //参数E2_PRAM_BASE_CUSTOM_ID+0x7C//参数ID，自定义，偏离线路报警语音,STRING,最大30字节,默认值请你按规定线路行驶
    	E2_REPORT_FREQ_EVENT_SWITCH_ID_LEN,          //参数E2_PRAM_BASE_CUSTOM_ID+0x7D//参数ID，自定义，事件项，保留，用于指定产生事件后上报时间间隔的事件项 BIT0位＝1：超速报警,DWORD
    	E2_RUN_FORBID_CALL_SWITCH_ID_LEN,              //参数E2_PRAM_BASE_CUSTOM_ID+0x7E//参数ID，自定义，行驶中禁止电话功能开关，0允许通话；1禁止通话，通用版默认为0，福建电信版默认为1
        E2_SIM_ICCID_NUMBER_ID_LEN,                    //参数E2_PRAM_BASE_CUSTOM_ID+0x7F//参数ID，自定义，SIM卡的ICCID号码,BCD[10],只读
        E2_LED_PORT_ID_LEN,//参数E2_PRAM_BASE_CUSTOM_ID+0x80参数ID，自定义，表明32pin的LED接口接的外设类型,
        E2_POS_PORT_ID_LEN,////参数ID，自定义，表明16pin接口接的外设类型
        0,//该参数EGS702使用
        E2_OBD_SWITCH_ID_LEN,//参数ID，自定义，1字节，0表示未接蓝牙OBD模组，1表示接了
        E2_SECOND_MAIN_SERVER_IP_ID_LEN, 			    //参数ID E2_PRAM_BASE_CUSTOM_ID+0x84，自定义，第2个连接主服务器IP地址或域名
        E2_SECOND_MAIN_SERVER_TCP_PORT_ID_LEN, 		//参数ID E2_PRAM_BASE_CUSTOM_ID+0x85，自定义，第2个连接主服务器TCP端口
        E2_SECOND_MAIN_SERVER_UDP_PORT_ID_LEN, 		//参数ID E2_PRAM_BASE_CUSTOM_ID+0x86，自定义，第2个连接主服务器UDP端口
        E2_SECOND_BACKUP_SERVER_IP_ID_LEN, 			//参数ID E2_PRAM_BASE_CUSTOM_ID+0x87，自定义，第2个连接备份服务器地址//IP或域名
        E2_SECOND_LOGINGPRS_PASSWORD_ID_LEN,		    //参数ID E2_PRAM_BASE_CUSTOM_ID+0x88，自定义，第2个连接鉴权码
        E2_SECOND_ACC_OFF_REPORT_TIME_ID_LEN,          //参数ID E2_PRAM_BASE_CUSTOM_ID+0x89，自定义，第2个连接休眠汇报时间间隔,单位秒,DWORD
        E2_SECOND_ACC_ON_REPORT_TIME_ID_LEN,           //参数IDE2_PRAM_BASE_CUSTOM_ID+0x8a，自定义，第2个连接缺省汇报时间间隔,单位秒,DWORD

