nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/EepromPram.c
};

//********************************外部变量**********************************
//********************************本地变量**********************************

//*******************************应答函数*********************************

//********************************函数声明**********************************
/*********************************************************************
//函数名称	:EepromPram_WritePram(u32 PramID, u8 *pBuffer, BufferLen)
//功能		:写eeprom参数
//输入		:PramID:参数ID;pBuffer:指向数据（待写入的字节流,写入的是数值的话则高字节应在前）的指针;
//		:BufferLen:数据的长度
//输出		:
//使用资源	:
//全局变量	:   
//调用函数	:
//中断资源	:  
//返回		:
//备注		:写入正确时，返回的长度等于BufferLen;写入错误时，返回0,此时可尝试再调用该函数写一次
*********************************************************************/
u16 EepromPram_WritePram(u32 PramID, u8 *pBuffer, u8 BufferLen)
{
    u8	VerifyByte;
    u8	sum;
    u8	i;
    u8	data;
    u8	Buffer[50];
    u8	PramType;//0为值,1为字符串
    u16	Address;
    u16	ID;
    //////////////////
	/*
    ID=E2ParamApp_ConvertPramIDToGroupIndex(PramID);
    if(0==ID)//不认识的ID
    {
        return 0;//先暂时不做
    }
	*/
		ID = PramID;
	  if(ID >= E2_PRAM_BASE_CUSTOM_ID)
		{
			ID = E2_SYSTEM_DEFINE_ID_MAX+ID-E2_PRAM_BASE_CUSTOM_ID;
		}
    //判断ID的大小
    if(ID >= E2_PRAM_ID_INDEX_MAX)
    {
        return 0;
    }
    //判断地址
    if(0 == EepromPramAddress[ID])
    {
        return 0;
    }
    //判断长度是否正确
    if((BufferLen > EepromPramLength[ID])||(0 == BufferLen))
    {
        return 0;//长度或参数ID出错
    }

    //求校验和
    VerifyByte = 0;
    for(i=0; i<BufferLen; i++)
    {
        VerifyByte += *(pBuffer+i);
    }
    //获取参数类型
    PramType = EepromPramSwitch[ID];
    //**************写参数****************
    //获取地址
    Address = EepromPramAddress[ID];

    if(1 == PramType)//写的是字符串
    {
        //第一个字节写入字符串的长度
        E2prom_WriteByte(Address,BufferLen);	
        Address++;
    }
    else//写的是十六进制值
    {

    }

    //内容写入到eeprom
    for(i=0; i<BufferLen; i++)
    {
        data = *(pBuffer+i);
        E2prom_WriteByte(Address,data);
        Address++;
    }

    //写入校验字节
    E2prom_WriteByte(Address,VerifyByte);
    Address++;

    //**************读参数****************
    if(BufferLen > 49)//字节数大于等于30字节的直接返回,不校验
    {
        return BufferLen;
    }
    else
    {
        //获取地址
        Address -= (BufferLen+1);
        //读出写入的内容，长度和校验字节除外
        E2prom_ReadByte(Address, Buffer, BufferLen);
        //计算读出数据的校验和
        sum = 0;
        for(i=0; i<BufferLen; i++)
        {
            sum += Buffer[i];
        }
        //比较校验和
        if(sum == VerifyByte)
        {
            return BufferLen;
        }
        else
        {
            return 0;
        }
    }
}
/*********************************************************************
//函数名称	:EepromPram_ReadPram(u32 PramID, u8 *pBuffer)
//功能		:读eeprom参数
//输入		:PramID:参数ID;pBuffer:指向数据（读出的字节流，读出的是数值则高字节在前）的指针;
//输出		:
//使用资源	:
//全局变量	:   
//调用函数	:
//中断资源	:  
//返回		:
//备注		:返回值>0表示正确读出，返回值==0表示读错误;
*********************************************************************/
u16 EepromPram_ReadPram(u32 PramID, u8 *pBuffer)
{
    u16	ID;
    u16	Address;
    u8	sum;
    u8	i;
    u8	Buffer[50];
    u8	length;
    /////////////////////////
    //ID=E2ParamApp_ConvertPramIDToGroupIndex(PramID);
    //if(0==ID)//不认识的ID
    //{
        //return 0;//先暂时不做
    //}
		ID = PramID;
	  if(ID >= E2_PRAM_BASE_CUSTOM_ID)
		{
			ID = E2_SYSTEM_DEFINE_ID_MAX+ID-E2_PRAM_BASE_CUSTOM_ID;
		}
    //判断ID的大小
    if(ID >= E2_PRAM_ID_INDEX_MAX)
    {
        return 0;
    }

    if(0 == EepromPramLength[ID])//参数ID号为保留的
    {
        return 0;
    }
    else if(1 == EepromPramLength[ID])
    {
        //获取地址
        Address = EepromPramAddress[ID];
        //读数值及校验字节
        E2prom_ReadByte(Address, Buffer, 2);
        //计算校验和
        if(Buffer[0] == Buffer[1])
        {
            memcpy(pBuffer,Buffer,1);
            return 1;
        }
    }
    else if(2 == EepromPramLength[ID])
    {
        //获取地址
        Address = EepromPramAddress[ID];
        //读数值及校验字节
        E2prom_ReadByte(Address, Buffer, 3);
        sum = Buffer[0] + Buffer[1];
        //计算校验和
        if(sum == Buffer[2])
        {
            memcpy(pBuffer,Buffer,2);
            return 2;
        }
    }
    else if(4 == EepromPramLength[ID])//数值
    {
        //获取地址
        Address = EepromPramAddress[ID];
        //读数值及校验字节
        E2prom_ReadByte(Address, Buffer, 5);
        //计算校验和
        sum = 0;
        for(i=0; i<4; i++)
        {
            sum += Buffer[i];
        }
        if(sum == Buffer[4])//校验正确
        {
            memcpy(pBuffer,Buffer,4);
            return 4;
        }
    }
    else//字符串
    {
        //获取地址
        Address = EepromPramAddress[ID];
        //读取长度
        E2prom_ReadByte(Address, Buffer, 1);
        Address++;
        if((PramID == E2_ALL_DRIVER_INFORMATION_ID)
        ||(PramID == E2_UPDATA_URL_ID))//长度超出
        {
            length = Buffer[0];
            //按长度再读取数据和校验字节
            E2prom_ReadByte(Address, pBuffer, length);
            return length;
        }
        else
        {
            length = Buffer[0];
            if(length > 49)
            {
                return 0;
            }
            //按长度再读取数据和校验字节
            E2prom_ReadByte(Address, Buffer, length+1);
            //计算校验和
            sum = 0;
            for(i=0; i<length; i++)
            {
                sum += Buffer[i];
            }
            if(sum == Buffer[length])//校验正确
            {
                memcpy(pBuffer,Buffer,length);
                return length;
            }
        }
    }
    return 0;
}
/*********************************************************************
//函数名称	:EepromPram_UpdateVariable(u16 PramID)
//功能		:更新PramID变量
//输入		:
//输出		:
//使用资源	:
//全局变量	:   
//调用函数	:
//中断资源	:  
//返回		:
//备注		:千万注意:EepromPram_UpdateVariable(E2_CAR_TOTAL_MILE_ID)不可随便调用，只能在设置完E2_CAR_TOTAL_MILE_ID后调用              
*********************************************************************/
/*
void EepromPram_UpdateVariable(u32 PramID)
{
	u8	Buffer[30];
	u8	BufferLen;
	u32	temp;
          
                IWDG_ReloadCounter();//喂狗//设置的参数较多，且可能还会调用其它更新函数，运行时间可能较长，加入喂狗
       
	switch(PramID)
	{
	case E2_TERMINAL_HEARTBEAT_ID:		
		{
			HeartBeat_UpdatePram();
			break;
		}//参数ID0x0001，终端心跳发送间隔，单位秒，默认值60
	case E2_TCP_ACK_OVERTIME_ID:		
	case E2_TCP_RESEND_TIMES_ID:			
		{
                        LoginUpdatePram();
			break;
		}//参数ID0x0003，TCP消息重传次数，默认值3
	case E2_UDP_ACK_OVERTIME_ID:		
		{
			break;
		}//参数ID0x0004，UDP消息应答超时时间，单位秒，默认值10
	case E2_UDP_RESEND_TIMES_ID:		
		{
			break;
		}//参数ID0x0005，UDP消息重传次数，默认值3
	case E2_SMS_ACK_OVERTIME_ID:		
		{
			break;
		}//参数ID0x0006，SMS消息应答超时时间，单位秒，默认值30
	case E2_SMS_RESEND_TIMES_ID:	
		{
			break;
		}	//参数ID0x0007，SMS消息重传次数，默认值3
	case E2_MAIN_SERVER_APN_ID:	
                {
                        break;
                }//参数ID0x0010，主服务器APN
	//E2_MAIN_SERVER_DIAL_NAME_ID:			//参数ID0x0011，主服务器无线通信拨号用户名
	//E2_MAIN_SERVER_DIAL_PASSWORD_ID:		//参数ID0x0012，主服务器无线通信拨号密码
	//E2_MAIN_SERVER_IP_ID:				//参数ID0x0013，主服务器地址，IP或域名
	//E2_BACKUP_SERVER_APN_ID:			//参数ID0x0014，备份服务器APN，无线通信拨号访问点
	//E2_BACKUP_SERVER_DIAL_NAME_ID:		//参数ID0x0015，备份服务器无线通信拨号用户名
	//E2_BACKUP_SERVER_DIAL_PASSWORD_ID:		//参数ID0x0016，备份服务器无线通信拨号密码
	//E2_BACKUP_SERVER_IP_ID:			//参数ID0x0017，备份服务器地址，IP或域名
	//E2_MAIN_SERVER_TCP_PORT_ID:			//参数ID0x0018，主服务器TCP端口
	//E2_MAIN_SERVER_UDP_PORT_ID:			//参数ID0x0019，主服务器UDP端口
	//E2_BACKUP_SERVER_TCP_PORT_ID:		//参数ID0x001a，备份服务器TCP端口
	//E2_BACKUP_SERVER_UDP_PORT_ID:		//参数ID0x001b，备份服务器UDP端口
	//E2_REGISTER_SMS_CENTER_NUM_ID:		//参数ID0x001C，注册短信中心号码
	//E2_PRIVILEGE_SMS_CENTER_NUM_ID:		//参数ID0x001D，控制短信号码（特权）
	//0,0,						//参数ID0x001E~0x001f，保留
        
        case E2_IC_MAIN_SERVER_IP_ID:	
		{
			break;
		}//参数ID0x001A,IC卡认证主服务器IP地址或域名
        case E2_IC_MAIN_SERVER_TCP_PORT_ID:	
		{
			break;
		}//参数ID0x001B,IC卡认证主服务器TCP端口
        case E2_IC_MAIN_SERVER_UDP_PORT_ID:	
		{
			break;
		}//参数ID0x001c,IC卡认证主服务器UDP端口
        case E2_IC_BACKUP_SERVER_IP_ID:	
		{
			break;
		}//参数ID0x001d,IC卡认证备份服务器IP地址或域名 
                
