nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/EepromPram.c
	case E2_POSITION_REPORT_STRATEGY_ID:	//参数ID0x0020，位置汇报策略
		{
			Report_UpdateOnePram(PRAM_REPORT_STRATEGY);
			break;
		}
	case E2_POSITION_REPORT_SCHEME_ID://参数ID0x0021，位置汇报方案
		{
			Report_UpdateOnePram(PRAM_REPORT_SCHEME);
			break;
		}
	case E2_DRIVER_UNLOGIN_REPORT_TIME_ID://0X0022 更新未登陆汇报时间间隔
		{
			Report_UpdateOnePram(PRAM_UNLOGIN_REPORT_TIME);
			break;
		}
	case E2_SLEEP_REPORT_TIME_ID://0X0027 更新ACC OFF汇报时间间隔
		{
			Report_UpdateOnePram(PRAM_ACC_OFF_REPORT_TIME);
			break;
		}
	case E2_EMERGENCY_REPORT_TIME_ID://0X0028 更新紧急报警时汇报时间间隔
		{
			Report_UpdateOnePram(PRAM_EMERGENCY_REPORT_TIME);
			break;
		}
	case E2_ACCON_REPORT_TIME_ID://0X0029 更新ACC ON汇报时间间隔
		{
			Report_UpdateOnePram(PRAM_ACC_ON_REPORT_TIME);
			break;
		}
	case E2_ACCON_REPORT_DISTANCE_ID://0X002C 更新ACC ON汇报距离间隔
		{
			Report_UpdateOnePram(PRAM_ACC_ON_REPORT_DISTANCE);
			break;
		}
	case E2_DRIVER_UNLOGIN_REPORT_DISTANCE_ID://0X002D 更新未登陆汇报距离间隔
		{
			Report_UpdateOnePram(PRAM_UNLOGIN_REPORT_DISTANCE);
			break;
		}
	case E2_SLEEP_REPORT_DISTANCE_ID://0X002E 更新休眠时汇报距离间隔
		{
			Report_UpdateOnePram(PRAM_ACC_OFF_REPORT_DISTANCE);
			break;
		}
	case E2_EMERGENCY_REPORT_DISTANCE_ID://0X002F 更新紧急报警时汇报距离间隔
		{
			Report_UpdateOnePram(PRAM_EMERGENCY_REPORT_DISTANCE);
			break;
		}
	case E2_CORNER_REPORT_ID:	
		{
			Corner_UpdataPram();
			break;
		}//参数ID0x0030，拐点补传角度,单位度/秒，默认值为15
	//0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,			//参数ID0x0031~0x003f，保留
	//E2_MONITOR_SERVER_PHONE_ID:			//参数ID0x0040，监控平台电话号码
	//E2_TERMINAL_RESET_PHONE_ID:			//参数ID0x0041，终端复位电话号码
	//E2_TERMINAL_DEFAULT_SET_PHONE_ID:		//参数ID0x0042，恢复出厂设置电话号码
	//E2_MONITOR_SERVER_SMS_PHONE_ID:		//参数ID0x0043，监控平台SMS电话号码
	//E2_SMS_TEXT_ALARM_PHONE_ID:			//参数ID0x0044，SMS文本报警电话号码
	//E2_TERMINAL_GET_PHONE_STRATEGY_ID:		//参数ID0x0045，终端电话接听策略
	case E2_MAX_PHONE_TIME_EACH_ID:
		{
            #ifdef USE_PHONE
            Phone_UpdateMaxPhoneTimeEach();
            #endif
			break;
		}//参数ID0x0046，每次最长通话时间，单位为秒，默认为0xffffffff，不限制
	case E2_MAX_PHONE_TIME_MONTH_ID:
		{
            #ifdef USE_PHONE
            Phone_UpdateMaxPhoneTimeMonth();
            #endif
			break;
		}//参数ID0x0047，每月最长通话时间，单位为秒，默认为0xffffffff，不限制
	//E2_MONITOR_PHONE_ID:				//参数ID0x0048，监听电话号码
	//E2_MONITOR_SERVER_PRIVILEGE_SMS_ID:		//参数ID0x0049，监管平台特权短信号码
	//0,0,0,0,0,0,					//参数ID0x004a~0x004f，保留
	case E2_ALARM_TEXT_SWITCH_ID:
		{
			break;
		}//参数ID0x0051，报警发送文本SMS开关，默认为全关
	case E2_ALARM_MASK_ID://参数ID0x0050，报警屏蔽字，默认为全开
	case E2_ALARM_PHOTO_SWITCH_ID://参数ID0x0052，报警拍摄开关，默认为全关
	case E2_ALARM_PHOTO_STORE_FLAG_ID://参数ID0x0053,报警拍摄存储标志//默认为全关     
    case E2_STATUS_PHOTO_SWITCH_ID://参数IDE2_PRAM_BASE_CUSTOM_ID+0x36，状态变化拍摄开关，默认为全关
	case E2_STATUS_PHOTO_STORE_FLAG_ID://参数IDE2_PRAM_BASE_CUSTOM_ID+0x37,状态变化拍摄存储标志//默认为全关
	case E2_DEFINE_ALARM_MASK_WORD_ID://参数ID，自定义，自定义报警屏蔽字，DWORD
		{
			Io_UpdataPram();
            Photo_UpdatePram();
			break;
		}
	case E2_KEY_FLAG_ID:	
		{
			break;
		}//参数ID0x0054，关键标志
	case E2_MAX_SPEED_ID:
		{
                        SpeedMonitor_UpdatePram(); //正常使用
#ifdef HUOYUN_DEBUG_OPEN
		        //SpeedMonitor_ParamInitialize();//北斗检测时使用
#endif
			break;
		}//参数ID0x0055，最高速度
	case E2_OVER_SPEED_KEEP_TIME_ID:
		{
                        SpeedMonitor_UpdatePram();//正常使用
#ifdef HUOYUN_DEBUG_OPEN
			//SpeedMonitor_ParamInitialize();//北斗检测时使用
#endif
			break;
		}//参数ID0x0056，超速持续时间，单位为秒，默认为10秒
	case E2_MAX_DRVIE_TIME_ID:
		{
                        TiredDrive_UpdatePram();//正常使用
#ifdef HUOYUN_DEBUG_OPEN
			//TiredDrive_ParamInitialize();//北斗检测时使用
                       // TiredDrive_ClearCurAllDriverRunInfo();//北斗检测时使用
#endif
			break;
		}//参数ID0x0057，连续驾驶时间门限，单位为秒，默认为240秒
	case E2_MAX_DRVIE_TIME_ONEDAY_ID:
		{
                       TiredDrive_UpdatePram();//正常使用
			break;
		}//参数ID0x0058，当天累计驾驶时间门限，单位为秒，默认为0
	case E2_MIN_RELAX_TIME_ID:
		{
			//更新疲劳驾驶参数
                        TiredDrive_UpdatePram();//正常使用
#ifdef HUOYUN_DEBUG_OPEN
			TiredDrive_ParamInitialize();//北斗检测时使用
                        TiredDrive_ClearCurAllDriverRunInfo();//北斗检测时使用
#endif
			break;
		}//参数ID0x0059，最小休息时间，单位为秒，默认为1200
	case E2_MAX_STOP_CAR_TIME_ID:			
		{
                        //SpeedMonitor_UpdateMaxStopCarTime();
			SpeedMonitor_UpdatePram();//超时超速标准化后更新为调用这个函数
			break;
		}//参数ID0x005A，最长停车时间，单位为秒，默认为0        
        case E2_SPEED_EARLY_ALARM_DVALUE_ID:	
		{
			SpeedMonitor_UpdatePram();
			break;
		}//参数ID0x005B,超速报警预警差值，单位为1/10Km/h 默认为50 
        case E2_TIRE_EARLY_ALARM_DVALUE_ID:	
		{
            TiredDrive_UpdatePram();
			break;
		}//参数ID0x005C,疲劳驾驶预警差值，单位为秒（s），>0  默认为1800
        case E2_SET_CRASH_ALARM_ID:	
		{
			BMA250_UpdataCrashAlarmParam();
			break;
		}//参数ID0x005D,碰撞报警参数设置
        case E2_SET_ROLLOVER_ALARM_ID:	
		{
			BMA250_UpdataRollOverAlarmParam();
			break;
		}//参数ID0x005E,侧翻报警参数设置：侧翻角度，单位1 度，默认为30 度             
        
        //0,0,0,0,0,                                      //参数ID0x005F~0x0063，保留                 
        
        case E2_TIME_PHOTO_CONTROL_ID:	
        case E2_MILE_PHOTO_CONTROL_ID:	
		{
			Photo_UpdatePram();
			break;
		}//参数ID0x0065,定距拍照控制

        //0,0,0,0,0,0,0,0,0,0,	                        //参数ID0x0066~0x006f，保留
	
        //E2_PICTURE_QUALITY_ID:			//参数ID0x0070，图像/视频质量，1~10,1为最好
	//E2_PICTURE_BRIGHTNESS_ID:			//参数ID0x0071，亮度，0~255
	//E2_PICTURE_CONTRAST_ID:		//参数ID0x0072，对比度，0~127
	//E2_PICTURE_SATURATION_ID:			//参数ID0x0073，饱和度，0~127
	//E2_PICTURE_CHROMA_ID:				//参数ID0x0074，色度，0~255
	//0,0,0,0,0,0,0,0,0,0,0,				//参数ID0x0075~0x007f，保留
	case E2_CAR_TOTAL_MILE_ID:				
		{
			//读取刚刚设置的里程
			EepromPram_ReadPram(E2_CAR_TOTAL_MILE_ID,Buffer);//0.1公里为单位
			temp = 0;
			temp |= Buffer[0] << 24;
			temp |= Buffer[1] << 16;
			temp |= Buffer[2] << 8;
			temp |= Buffer[3];
			//设置初始里程
			GpsMile_SetPram(temp);
			
			break;
		}//参数ID0x0080，车辆里程表读数，0.1km,千万注意:EepromPram_UpdateVariable(E2_CAR_TOTAL_MILE_ID)不可随便调用，只能在设置完E2_CAR_TOTAL_MILE_ID后调用                                             
	//E2_CAR_PROVINCE_ID:			//参数ID0x0081，车辆所在的省域ID
	///E2_CAR_CITY_ID:				//参数ID0x0082，车辆所在的市域ID
	//E2_CAR_PLATE_NUM_ID:				//参数ID0x0083，公安交通管理部门颁发的机动车号牌
	//E2_CAR_PLATE_COLOR_ID:			//参数ID0x0084，车牌颜色，按照JT/T415-2006的5.4.12
	
