nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/EepromPram.c
        case E2_GPS_SET_MODE_ID:	
		{
                        GnssCheckChangePar();
			
			break;
		}//参数ID0x0090,GNSS 定位模式，默认为0x02 北斗定位
        case E2_GPS_SET_BAUD_ID:	
		{
                        GnssCheckChangePar();
			break;
		}//参数ID0x0091,GNSS 波特率，默认为0x01 9600
        case E2_GPS_SET_OUTPUT_RATE_ID:	
		{
                        GnssCheckChangePar();
			break;
		}//参数ID0x0092,GNSS 模块详细定位数据输出频率,默认为0x01 1000ms
        case E2_GPS_SET_GATHER_RATE_ID:	
		{
                        GnssCheckChangePar();
			break;
		}//参数ID0x0093,GNSS 模块详细定位数据采集频率，单位为秒，默认为1
        case E2_GPS_SET_UPLOAD_MODE_ID:	
		{
                         GnssCheckChangePar();
			break;
		}//参数ID0x0094,GNSS 模块详细定位数据上传方式，默认为0x00，本地存储不上传
        case E2_GPS_SET_UPLOAD_VALUE_ID:	
		{
                         GnssCheckChangePar();
			break;
		}//参数ID0x0095,GNSS 模块详细定位数据上传设置,默认为0 
        case E2_CAN1_GATHER_TIME_ID://参数ID0x0100,CAN 总线通道1 采集时间间隔(ms)，0 表示不采集 	
                {
                        UpdataOnePram_SamplePeriod_CAN1();
                        break;
                }
        case E2_CAN1_UPLOAD_TIME_ID://参数ID0x0101,CAN 总线通道1 上传时间间隔(s)，0 表示不上传	
                {
                        UpdataOnePram_UploadPeriod_CAN1();
                        break;
                }
        case E2_CAN2_GATHER_TIME_ID://参数ID0x0102,CAN 总线通道2 采集时间间隔(ms)，0 表示不采集
                {
                        UpdataOnePram_SamplePeriod_CAN2();
                        break;
                }
        case E2_CAN2_UPLOAD_TIME_ID://参数ID0x0103,CAN 总线通道2 上传时间间隔(s)，0 表示不上传	
                {
                        UpdataOnePram_UploadPeriod_CAN2();
                        break;
                }
        case E2_CAN_SET_ONLY_GATHER_0_ID:	
	        {
                    UpdataOnePram_Sample_Single(  E2_CAN_SET_ONLY_GATHER_0_ID  ); 
		      break;
                }//参数ID0x0110,CAN 总线ID 单独采集设置BYTE[8] 
         case E2_CAN_SET_ONLY_GATHER_1_ID:	
	        {
                    UpdataOnePram_Sample_Single(  E2_CAN_SET_ONLY_GATHER_1_ID  ); 
		      break;
                }//参数ID0x0111,CAN 总线ID 单独采集设置BYTE[8]                                                                          
                                                                                       
         //E2_LOGINGPRS_PASSWORD_ID:			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x00，自定义，鉴权码
	//E2_REGISTER_SMS_PHONE_ID:			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x01，自定义，注册短消息号码
	case E2_PROGRAM_UPDATA_REQUEST_ID:
		{
			break;
		}//参数IDE2_PRAM_BASE_CUSTOM_ID+0x02，自定义，程序升级请求标志
	//E2_PROGRAM_UPDATA_VERIFYCODE_ID:		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x03，自定义，程序升级校验码
	//E2_PROGRAM_UPDATA_LENGTH_ID:		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x04，自定义，程序升级长度
	case E2_MANUFACTURE_ID:				
		{
			BufferLen = EepromPram_ReadPram(E2_MANUFACTURE_ID, Buffer);
			if(0 == BufferLen)
			{
			
			}
			break;
		}//参数IDE2_PRAM_BASE_CUSTOM_ID+0x05，自定义，制造商ID，5字节
	case E2_DEVICE_ID:
		{
			BufferLen = EepromPram_ReadPram(E2_DEVICE_ID, Buffer);
			if(0 == BufferLen)
			{
			
			}
			break;
		}//参数IDE2_PRAM_BASE_CUSTOM_ID+0x06，自定义，终端ID，7字节
	case E2_DEVICE_PHONE_ID:	
		{
			//TerminalPhone_UpdataPram();
			break;
		}		
		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x07，自定义，终端手机号，6字节
	//E2_CAR_IDENTIFICATION_CODE_ID:		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x08，自定义，车辆识别码
	//E2_CAR_TYPE_ID:				//参数IDE2_PRAM_BASE_CUSTOM_ID+0x09，自定义，车牌分类
	//E2_CURRENT_DRIVER_ID:			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x0A，自定义，当前驾驶员代码
	///E2_CURRENT_LICENSE_ID:			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x0B，自定义，当前驾驶证号码
	//E2_FIRMWARE_VERSION_ID:			//参数IDE2_PRAM_BASE_CUSTOM_ID+0x0C，自定义，固件版本号
	//E2_ALL_DRIVER_INFORMATION_ID:		//参数IDE2_PRAM_BASE_CUSTOM_ID+0x0D，自定义，所有驾驶员信息
	case E2_SPEED_SENSOR_COEF_ID:
		{
			//PulsePerKm_UpDatePram();
			break;
		}//参数IDE2_PRAM_BASE_CUSTOM_ID+0x0E，自定义，速度传感器系数
	case E2_CAR_FEATURE_COEF_ID:
		{
			Pulse_UpdataPram();
			break;
		}//参数IDE2_PRAM_BASE_CUSTOM_ID+0x0F，自定义，车辆特征系数
	case E2_SPEED_SELECT_ID:
		{
			SpeedFlagUpdatePram();
			SpeedMonitor_UpdatePram();
			break;
		}//参数IDE2_PRAM_BASE_CUSTOM_ID+0x10，自定义，速度选择开关
	case E2_BACKLIGHT_SELECT_ID:	
		{
			break;
		}//参数IDE2_PRAM_BASE_CUSTOM_ID+0x11，自定义，背光选择开关
	case E2_DOOR_SET_ID:	
		{
			Io_UpdataPram();
			break;
		}//参数IDE2_PRAM_BASE_CUSTOM_ID+0x29，自定义，车门选择，0为车门负有效，1为车门正有效
	case E2_CDMA_SLEEP_ID:
		{
			break;
		}//参数IDE2_PRAM_BASE_CUSTOM_ID+0x2b，自定义，CDMA休眠开关，1为开，非1为关，默认为关
	case E2_GPS_CONTROL_ID:
		{
			UpdataAccOffGpsControlFlag();
			break;
		}//参数IDE2_PRAM_BASE_CUSTOM_ID+0x30，自定义，ACC OFF时GPS模块控制,0为关,1为打开
	case E2_USB_UPDATA_FLAG_ID:
		{
			break;
		}//参数IDE2_PRAM_BASE_CUSTOM_ID+0x31，自定义，USB升级标志
	case E2_TAXIMETER_CONTROL_ID:
		{
			UpdataTaximeterControlFlag();
			break;
		}//参数IDE2_PRAM_BASE_CUSTOM_ID+0x32，自定义，计价器功能开关,0为关闭,1为开启
	case E2_TOPLIGHT_CONTROL_ID:
		{
			UpdataToplightControlFlag();
			break;
		}//参数IDE2_PRAM_BASE_CUSTOM_ID+0x33，自定义，顶灯功能开关,0为关闭,1为开启
	case E2_LEDLIGHT_CONTROL_ID:
		{
			UpdataLedlightControlFlag();
			break;
		}//参数IDE2_PRAM_BASE_CUSTOM_ID+0x34，自定义，LED广告功能开关,0为关闭,1为开启
	case E2_UNLOGIN_TTS_PLAY_ID:
		{
			ICCard_UpdataParamVoicePrompt();
			break;
		}
    case E2_LED_PORT_ID:
    case E2_LOAD_MAX_ID:
		{
			CarLoad_UpdatePram();
                        UpdatePeripheralType();
			break;
		}
    case E2_POS_PORT_ID:
        {
            OilWear_Updata16PINPortPeripheralParam();
            UpdatePeripheralType();
            break;
        }
	case E2_SHUTDOWN_MODE_TIME_ID:
	case E2_SHUTDOWN_MODE_POWER_ID:
		{
			SleepDeep_UpdateParam();
			break;
		}        
	case E2_OVERSPEED_PREALARM_KEEPTIME_ID://参数ID，自定义，超速预警持续时间,DWORD,单位秒,默认值3
	case E2_OVERSPEED_PREALARM_VOICE_ID://参数ID，自定义，超速预警语音,STRING,最大30字节,默认值为请控制车速
	case E2_OVERSPEED_PREALARM_GPROUP_TIME_ID://参数ID，自定义，超速预警每组提示时间间隔,DWORD,单位分钟,默认值5
	case E2_OVERSPEED_PREALARM_NUMBER_ID://参数ID，自定义，超速预警每组提示次数,DWORD,默认值3
	case E2_OVERSPEED_PREALARM_NUMBER_TIME_ID://参数ID，自定义，超速预警每次提示时间间隔,DWORD,单位秒,默认值10
	//case	E2_OVERSPEED_ALARM_VALUE_ID://参数ID，自定义，超速报警值，DWORD,单位km/h,默认值130,与标准的0x0055重复了
	//case	E2_OVERSPEED_ALARM_KEEPTIME_ID://参数ID，自定义，超速报警持续时间，DWORD,单位秒默认值10,与标准的0x0056重复了
	case E2_OVERSPEED_ALARM_VOICE_ID://参数ID，自定义，超速报警语音,STRING,最大30字节,
	case E2_OVERSPEED_ALARM_GPROUP_TIME_ID://参数ID，自定义，超速报警每组提示时间间隔,DWORD,单位分钟,默认值5
	case E2_OVERSPEED_ALARM_NUMBER_ID://参数ID，自定义，超速报警每组提示次数,DWORD,默认值3
	case E2_OVERSPEED_ALARM_NUMBER_TIME_ID://参数ID，自定义，超速报警每次提示时间间隔,DWORD,单位秒,默认值10
	case E2_OVERSPEED_ALARM_REPORT_TIME_ID://参数ID，自定义，超速报警位置上报时间间隔,DWORD,单位秒,默认值0，这一项前面调用了，有别的模块需要用到
	case E2_OVERSPEED_NIGHT_TIME_ID://参数ID，自定义，夜间时间,BYTE[14],作STRING处理,默认值全0,夜间超速使用
	case E2_NIGHT_OVERSPEED_PERCENT_ID://参数ID，自定义，夜间超速报警及预警百分比,DWORD,默认值80
	case E2_NIGHT_DRIVE_PREALARM_TIME_ID://参数ID，自定义，夜间行驶预警时间,,DWORD,单位分钟,默认值10
	case E2_NIGHT_DRIVE_PREALARM_VOICE_ID://参数ID，自定义，夜间行驶预警语音,STRING,最大30字节,默认值"即将进入夜间时段"
	case E2_NIGHT_DRIVE_PREALARM_GPOUP_TIME_ID://参数ID，自定义，夜间行驶预警提示时间间隔(每组),DWORD,单位分钟,默认值5
	case E2_NIGHT_DRIVE_PREALARM_NUMBER_ID://参数ID，自定义，夜间行驶预警提示次数,,DWORD,默认值3
	case E2_FORBID_DRIVE_NIGHT_TIME_ID://参数ID，自定义，停车休息(禁止行驶)夜间时间,BYTE[14],作STRING处理,默认值全0
	case E2_FORBID_DRIVE_PREALARM_TIME_ID://参数ID，自定义，禁行时段到达提醒提前时间,DWORD,单位分钟,默认值30
	case E2_FORBID_DRIVE_PREALARM_VOICE_ID://参数ID，自定义，禁行时段到达提醒语音,STRING,最大30字节,默认值"请按规定时间停车休息"
	case E2_FORBID_DRIVE_PREALARM_GPOUP_TIME_ID://参数ID，自定义，禁行时段提醒时间间隔,DWORD,单位分钟,默认值5
	case E2_FORBID_DRIVE_PREALARM_NUMBER_ID://参数ID，自定义，禁行时段到达提醒播报的次数,DWORD,默认值3
	case E2_FORBID_DRIVE_ALARM_VOICE_ID://参数ID，自定义，禁行时段到达提醒语音,STRING,最大30字节,默认值"请按规定时间停车休息"
	case E2_FORBID_DRIVE_ALARM_GPOUP_TIME_ID://参数ID，自定义，禁行时段提醒时间间隔,DWORD,单位分钟,默认值5
	case E2_FORBID_DRIVE_ALARM_NUMBER_ID://参数ID，自定义，禁行时段到达提醒播报的次数,DWORD,默认值3
	case E2_FORBID_DRIVE_RUN_SPEED_ID://参数ID，自定义，禁行时段行驶速度,单位km/h,DWORD,默认值20
	case E2_FORBID_DRIVE_RUN_SPEED_KEEPTIME_ID://参数ID，自定义，禁行时段行驶速度持续时间,单位分钟,DWORD,默认值5，
	case E2_REPORT_FREQ_EVENT_SWITCH_ID://参数ID，自定义，事件项，保留，用于指定产生事件后上报时间间隔的事件项 BIT0位＝1：超速报警,BIT1位＝1：超时报警,DWORD
		{
			SpeedMonitor_UpdatePram();
			break;
		}			//当速度大于禁行时段行驶速度且持续时间达到禁行时段行驶速度持续时间，认定为行驶
	case E2_TIRED_DRIVE_NIGHT_TIME_ID://参数ID，自定义，夜间时间,BYTE[14],作STRING处理,默认值全0,夜间超时使用
	case E2_NIGHT_MAX_DRVIE_TIME_ID://参数ID，自定义，夜间连续驾驶时间门限,单位秒,DWORD,默认值7200
	case E2_NIGHT_MIN_RELAX_TIME_ID://参数ID，自定义，夜间最小休息时间,单位秒,DWORD,默认值1200
	case E2_TIRED_DRIVE_ALARM_TIME_ID://参数ID，自定义，超时驾驶报警提示语音有效时间,单位分钟,DWORD,默认值30,国标要求
	case E2_TIRED_DRIVE_PREALARM_VOICE_ID://参数ID，自定义，超时驾驶预警提示语音,STRING,最大30字节,默认值请勿超时驾驶
	case E2_TIRED_DRIVE_PREALARM_GPOUP_TIME_ID://参数ID，自定义，超时驾驶预警每组提示时间间隔,单位分钟,DWORD,默认值5
	case E2_TIRED_DRIVE_PREALARM_NUMBER_ID://参数ID，自定义，超时驾驶预警每组提示次数,DWORD,默认值3
	case E2_TIRED_DRIVE_PREALARM_NUMBER_TIME_ID://参数ID，自定义，超时驾驶预警每次提示时间间隔,单位秒,DWORD,默认值10
	case E2_TIRED_DRIVE_ALARM_VOICE_ID://参数ID，自定义，超时驾驶报警提示语音,STRING,最大30字节,默认值请勿超时驾驶
	case E2_TIRED_DRIVE_ALARM_GPOUP_TIME_ID://参数ID，自定义，超时驾驶报警每组提示时间间隔,单位分钟,DWORD,默认值5
	case E2_TIRED_DRIVE_ALARM_NUMBER_ID://参数ID，自定义，超时驾驶报警每组提示次数,DWORD,默认值3
	case E2_TIRED_DRIVE_ALARM_NUMBER_TIME_ID://参数ID，自定义，超时驾驶报警每次提示时间间隔,单位秒,DWORD,默认值10
	case E2_TIRED_DRIVE_REPORT_OPEN_TIME_ID://参数ID，自定义，超时驾驶报警位置上报开启时间,单位秒,DWORD,默认值0xffffffff,不开启,九通为20分钟
	case E2_TIRED_DRIVE_REPORT_TIME_ID://参数ID，自定义，超时驾驶报警位置上报时间间隔,单位秒,DWORD,默认值300,九通为5分钟
	case E2_TIRED_DRIVE_RUN_SPEED_ID://参数ID，自定义，超时驾驶行驶判定速度,单位km/h,DWORD,默认值5,
	case E2_TIRED_DRIVE_RUN_KEEPTIME_ID://参数ID，自定义，超时驾驶行驶判定持续时间,单位秒,DWORD,默认值10,
		{
			TiredDrive_UpdatePram();
			break;
		}
	case E2_ROUTE_EXCURSION_ALARM_NUMBER_ID://参数ID，自定义，偏离线路 报警次数，0：不播报，255：持续播报 DWORD,默认值3
	case E2_ROUTE_EXCURSION_ALARM_GPOUP_TIME_ID://参数ID，自定义，偏离线路报警语音时间间隔,DWORD,默认值5
	case E2_ROUTE_EXCURSION_ALARM_VOICE_ID://参数ID，自定义，偏离线路报警语音,STRING,最大30字节,默认值请你按规定线路行驶
		{
			Route_UpdatePram();
			break;
		}
        case E2_SECOND_ACC_OFF_REPORT_TIME_ID:
                {
                        Report_UpdateOnePram(PRAM_SECOND_LINK_ACC_OFF_REPORT_TIME);
                        break;
                }
        case E2_SECOND_ACC_ON_REPORT_TIME_ID:
                {
                        Report_UpdateOnePram(PRAM_SECOND_LINK_ACC_ON_REPORT_TIME);
                        break;
                        
