nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/EepromPram.c
                }
        case E2_OBD_SWITCH_ID:
                {
                        Report_UpdateOnePram(PRAM_SECOND_LINK_ACC_ON_REPORT_TIME);
                        break;
                        
                }
                
		default:	break;
	}
}
*/
/*********************************************************************
//函数名称	:EepromPram_DefaultSet(void)
//功能		:系统第1次运行时的默认设置
//输入		:
//输出		:
//使用资源	:
//全局变量	:   
//调用函数	:
//中断资源	:  
//返回		:
//备注		:使用恢复默认出厂设置也会将参数设置为如下所示
*********************************************************************/
void EepromPram_DefaultSet(void)
{
    u32	temp;
    u8	Buffer[31];
    u8	BufferLen;
    u8	i;

    IWDG_ReloadCounter();//喂狗//设置的参数较多，且可能还会调用其它更新函数，运行时间可能较长，加入喂狗
    //0x0001	终端心跳发送间隔//单位秒//默认值60
    temp = 60;
    //temp = 180;//行标检测时设置长些，以免影响其它检测功能
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_TERMINAL_HEARTBEAT_ID, Buffer, E2_TERMINAL_HEARTBEAT_LEN))
    {
        EepromPram_WritePram(E2_TERMINAL_HEARTBEAT_ID, Buffer, E2_TERMINAL_HEARTBEAT_LEN);
    }
    //0x0002	TCP消息应答超时时间//单位秒//默认值10
    #ifdef  HUOYUN_DEBUG_OPEN
    temp = 5;
    #else
    temp = 10;
    #endif
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_TCP_ACK_OVERTIME_ID, Buffer, E2_TCP_ACK_OVERTIME_LEN))
    {
        EepromPram_WritePram(E2_TCP_ACK_OVERTIME_ID, Buffer, E2_TCP_ACK_OVERTIME_LEN);
    }
    //0x0003	TCP消息重传次数//默认值3
    temp = 3;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_TCP_RESEND_TIMES_ID, Buffer, E2_TCP_RESEND_TIMES_LEN))
    {
        EepromPram_WritePram(E2_TCP_RESEND_TIMES_ID, Buffer, E2_TCP_RESEND_TIMES_LEN);
    }
    //0x0004	UDP消息应答超时时间//单位秒//默认值10
    #ifdef  HUOYUN_DEBUG_OPEN
    temp = 5;
    #else
    temp = 10;
    #endif
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_UDP_ACK_OVERTIME_ID, Buffer, E2_UDP_ACK_OVERTIME_LEN))
    {
        EepromPram_WritePram(E2_UDP_ACK_OVERTIME_ID, Buffer, E2_UDP_ACK_OVERTIME_LEN);
    }
    //0x0005	UDP消息重传次数//默认值3
    temp = 3;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_UDP_RESEND_TIMES_ID, Buffer, E2_UDP_RESEND_TIMES_LEN))
    {
        EepromPram_WritePram(E2_UDP_RESEND_TIMES_ID, Buffer, E2_UDP_RESEND_TIMES_LEN);
    }
    //0x0006	SMS消息应答超时时间//单位秒//默认值30
    #ifdef  HUOYUN_DEBUG_OPEN
    temp = 5;
    #else
    temp = 30;
    #endif
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_SMS_ACK_OVERTIME_ID, Buffer, E2_SMS_ACK_OVERTIME_LEN))
    {
        EepromPram_WritePram(E2_SMS_ACK_OVERTIME_ID, Buffer, E2_SMS_ACK_OVERTIME_LEN);
    }
    //0x0007	SMS消息重传次数//默认值3
    temp = 3;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_SMS_RESEND_TIMES_ID, Buffer, E2_SMS_RESEND_TIMES_LEN))
    {
        EepromPram_WritePram(E2_SMS_RESEND_TIMES_ID, Buffer, E2_SMS_RESEND_TIMES_LEN);
    }

    #ifdef HUOYUN_DEBUG_OPEN
    //0x0010       主服务器APN
    strcpy((char *)Buffer,"cmnet");
    BufferLen = strlen((char const *)Buffer);
    if(0 == EepromPram_WritePram(E2_MAIN_SERVER_APN_ID, Buffer, BufferLen))
    {
        EepromPram_WritePram(E2_MAIN_SERVER_APN_ID, Buffer, BufferLen);
    }
    //0x0011  主服务器无线通信拨号用户名
    strcpy((char *)Buffer,"card");
    BufferLen = strlen((char const *)Buffer);
    if(0 == EepromPram_WritePram(E2_MAIN_SERVER_DIAL_NAME_ID, Buffer, BufferLen))
    {
        EepromPram_WritePram(E2_MAIN_SERVER_DIAL_NAME_ID, Buffer, BufferLen);
    }
    //0x0012  主服务器无线通信拨号密码
    strcpy((char *)Buffer,"card");
    BufferLen = strlen((char const *)Buffer);
    if(0 == EepromPram_WritePram(E2_MAIN_SERVER_DIAL_PASSWORD_ID, Buffer, BufferLen))
    {
        EepromPram_WritePram(E2_MAIN_SERVER_DIAL_PASSWORD_ID, Buffer, BufferLen);
    }

    //0x0014 备份服务器APN
    strcpy((char *)Buffer,"cmnet");
    BufferLen = strlen((char const *)Buffer);
    if(0 == EepromPram_WritePram(E2_BACKUP_SERVER_APN_ID, Buffer, BufferLen))
    {
        EepromPram_WritePram(E2_BACKUP_SERVER_APN_ID, Buffer, BufferLen);
    }
    //0x0015 备份服务器无线通信拨号用户名
    strcpy((char *)Buffer,"card");
    BufferLen = strlen((char const *)Buffer);
    if(0 == EepromPram_WritePram(E2_BACKUP_SERVER_DIAL_NAME_ID, Buffer, BufferLen))
    {
        EepromPram_WritePram(E2_BACKUP_SERVER_DIAL_NAME_ID, Buffer, BufferLen);
    }
    //0x0016 备份服务器无线通信拨号密码
    strcpy((char *)Buffer,"card");
    BufferLen = strlen((char const *)Buffer);
    if(0 == EepromPram_WritePram(E2_BACKUP_SERVER_DIAL_PASSWORD_ID, Buffer, BufferLen))
    {
        EepromPram_WritePram(E2_BACKUP_SERVER_DIAL_PASSWORD_ID, Buffer, BufferLen);
    }    
    #endif
    //0x0020	位置汇报策略,0为定时,1为定距,2为定时定距,默认为0
    temp = 0;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_POSITION_REPORT_STRATEGY_ID, Buffer, E2_POSITION_REPORT_STRATEGY_LEN))
    {
        EepromPram_WritePram(E2_POSITION_REPORT_STRATEGY_ID, Buffer, E2_POSITION_REPORT_STRATEGY_LEN);
    }
    //0x0021	位置汇报方案,0根据ACC状态,1根据登录及ACC状态,默认为0
    temp = 0;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_POSITION_REPORT_SCHEME_ID, Buffer, E2_POSITION_REPORT_SCHEME_LEN))
    {
        EepromPram_WritePram(E2_POSITION_REPORT_SCHEME_ID, Buffer, E2_POSITION_REPORT_SCHEME_LEN);
    }

    //0x0022	驾驶员未登录汇报时间间隔//单位为秒//默认值为60
    #ifdef  HUOYUN_DEBUG_OPEN
    temp = 30;
    #else
    temp = 60;
    #endif
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_DRIVER_UNLOGIN_REPORT_TIME_ID, Buffer, E2_DRIVER_UNLOGIN_REPORT_TIME_LEN))
    {
        EepromPram_WritePram(E2_DRIVER_UNLOGIN_REPORT_TIME_ID, Buffer, E2_DRIVER_UNLOGIN_REPORT_TIME_LEN);
    }

    //0x0027	休眠时汇报时间间隔//单位为秒//默认值为240
    #ifdef  HUOYUN_DEBUG_OPEN
    temp = 300;
    #else
    temp = 240;
    #endif
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_SLEEP_REPORT_TIME_ID, Buffer, E2_SLEEP_REPORT_TIME_LEN))
    {
        EepromPram_WritePram(E2_SLEEP_REPORT_TIME_ID, Buffer, E2_SLEEP_REPORT_TIME_LEN);
    }

    //0x0028	紧急报警时汇报时间间隔//单位为秒//默认值为10
    temp = 10;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_EMERGENCY_REPORT_TIME_ID, Buffer, E2_EMERGENCY_REPORT_TIME_LEN))
    {
        EepromPram_WritePram(E2_EMERGENCY_REPORT_TIME_ID, Buffer, E2_EMERGENCY_REPORT_TIME_LEN);
    }

