nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/EepromPram.c
    //0x0029	缺省时间汇报间隔,单位为秒,默认为30
    temp = 30;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_ACCON_REPORT_TIME_ID, Buffer, E2_ACCON_REPORT_TIME_LEN))
    {
        EepromPram_WritePram(E2_ACCON_REPORT_TIME_ID, Buffer, E2_ACCON_REPORT_TIME_LEN);
    }

    //0x002C	缺省距离汇报间隔,单位为米,默认为500
    temp = 500;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_ACCON_REPORT_DISTANCE_ID, Buffer, E2_ACCON_REPORT_DISTANCE_LEN))
    {
        EepromPram_WritePram(E2_ACCON_REPORT_DISTANCE_ID, Buffer, E2_ACCON_REPORT_DISTANCE_LEN);
    }

    //0x002D	驾驶员未登录汇报距离间隔//单位为米//默认值为500
    temp = 500;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_DRIVER_UNLOGIN_REPORT_DISTANCE_ID, Buffer, E2_DRIVER_UNLOGIN_REPORT_DISTANCE_LEN))
    {
        EepromPram_WritePram(E2_DRIVER_UNLOGIN_REPORT_DISTANCE_ID, Buffer, E2_DRIVER_UNLOGIN_REPORT_DISTANCE_LEN);
    }
    //0x002e	休眠时汇报距离间隔//单位为米//默认值为200
    #ifdef  HUOYUN_DEBUG_OPEN//modify by joneming
    temp = 500;
    #else
    temp = 200;
    #endif
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_SLEEP_REPORT_DISTANCE_ID, Buffer, E2_SLEEP_REPORT_DISTANCE_LEN))
    {
        EepromPram_WritePram(E2_SLEEP_REPORT_DISTANCE_ID, Buffer, E2_SLEEP_REPORT_DISTANCE_LEN);
    }
    //0x002f	紧急报警时汇报距离间隔//单位为米//默认值为200
    temp = 200;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_EMERGENCY_REPORT_DISTANCE_ID, Buffer, E2_EMERGENCY_REPORT_DISTANCE_LEN))
    {
        EepromPram_WritePram(E2_EMERGENCY_REPORT_DISTANCE_ID, Buffer, E2_EMERGENCY_REPORT_DISTANCE_LEN);
    }
    //0x0030	拐点补传角度,单位度/秒//默认值为30
    #ifdef  HUOYUN_DEBUG_OPEN
    temp = 45;
    #else
    temp = 30;
    #endif
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_CORNER_REPORT_ID, Buffer, E2_CORNER_REPORT_LEN))
    {
        EepromPram_WritePram(E2_CORNER_REPORT_ID, Buffer, E2_CORNER_REPORT_LEN);
    }

    //0x0031	电子围栏半径,单位米,默认值500
    temp = 500;//modify by joneming
    Public_ConvertShortToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_ELECTRON_RADIUS_ID, Buffer, E2_ELECTRON_RADIUS_LEN))
    {
        EepromPram_WritePram(E2_ELECTRON_RADIUS_ID, Buffer, E2_ELECTRON_RADIUS_LEN);
    }


    //*************通话功能参数**********************
    //0x0045	终端电话接听策略,0:自动接听;1:手动接听,默认为0
    #ifdef  HUOYUN_DEBUG_OPEN
    temp = 1;
    #else
    temp = 0;
    #endif
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_TERMINAL_GET_PHONE_STRATEGY_ID, Buffer, E2_TERMINAL_GET_PHONE_STRATEGY_LEN))
    {
        EepromPram_WritePram(E2_TERMINAL_GET_PHONE_STRATEGY_ID, Buffer, E2_TERMINAL_GET_PHONE_STRATEGY_LEN);
    }
    //0x0046	每次最长通话时间//单位为秒//默认为0,关闭该功能
    #ifdef  HUOYUN_DEBUG_OPEN
    temp = 120;
    #else
    temp = 0;
    #endif
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_MAX_PHONE_TIME_EACH_ID, Buffer, E2_MAX_PHONE_TIME_EACH_LEN))
    {
        EepromPram_WritePram(E2_MAX_PHONE_TIME_EACH_ID, Buffer, E2_MAX_PHONE_TIME_EACH_LEN);
    }
    //0x0047	每月最长通话时间//单位为秒//默认为0,关闭该功能
    #ifdef  HUOYUN_DEBUG_OPEN
    temp = 36000;
    #else
    temp = 0;
    #endif
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_MAX_PHONE_TIME_MONTH_ID, Buffer, E2_MAX_PHONE_TIME_MONTH_LEN))
    {
        EepromPram_WritePram(E2_MAX_PHONE_TIME_MONTH_ID, Buffer, E2_MAX_PHONE_TIME_MONTH_LEN);
    }
    ///////////////
    IWDG_ReloadCounter();//喂狗//设置的参数较多，且可能还会调用其它更新函数，运行时间可能较长，加入喂狗
    //0x0050	报警屏蔽字//bit9,11,12默认屏蔽,LCD屏故障,摄像头故障,IC卡模块故障,VSS连接异常默认为屏蔽
    #ifdef  HUOYUN_DEBUG_OPEN
    temp = 0;//货运平台要求为0
    #else
    temp = 0x01001a00;
    #endif
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_ALARM_MASK_ID, Buffer, E2_ALARM_MASK_LEN))
    {
        EepromPram_WritePram(E2_ALARM_MASK_ID, Buffer, E2_ALARM_MASK_LEN);
    }
    //0x0051	报警发送文本SMS开关//相应位为1表示产生报警了需发送报警短信,默认为0
    temp = 0;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_ALARM_TEXT_SWITCH_ID, Buffer, E2_ALARM_TEXT_SWITCH_LEN))
    {
        EepromPram_WritePram(E2_ALARM_TEXT_SWITCH_ID, Buffer, E2_ALARM_TEXT_SWITCH_LEN);
    }
    //0x0052	报警拍摄开关//相应位为1表示产生报警了需触发拍照,默认为1,紧急报警触发拍照
    temp = 1;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_ALARM_PHOTO_SWITCH_ID, Buffer, E2_ALARM_PHOTO_SWITCH_LEN))
    {
        EepromPram_WritePram(E2_ALARM_PHOTO_SWITCH_ID, Buffer, E2_ALARM_PHOTO_SWITCH_LEN);
    }
    //0x0053	报警拍摄存储标志//相应位为1表示存储,0表示上传,默认为0
    temp = 0;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_ALARM_PHOTO_STORE_FLAG_ID, Buffer, E2_ALARM_PHOTO_STORE_FLAG_LEN))
    {
        EepromPram_WritePram(E2_ALARM_PHOTO_STORE_FLAG_ID, Buffer, E2_ALARM_PHOTO_STORE_FLAG_LEN);
    }
    //0x0054	关键标志//相应位为1表示该报警为关键报警,是关键报警则不受报警屏蔽字的限制,默认为0
    temp = 0;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_KEY_FLAG_ID, Buffer, E2_KEY_FLAG_LEN))
    {
        EepromPram_WritePram(E2_KEY_FLAG_ID, Buffer, E2_KEY_FLAG_LEN);
    }

    //0x0055	最高速度,单位km/h,DWORD,默认值130,九通需求为100km/h
    #ifdef  HUOYUN_DEBUG_OPEN
    temp = 100;
    #else
    temp = 100;//dxl,2015.5.27,之前为130现在改为100与九通一直
    #endif
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_MAX_SPEED_ID, Buffer, E2_MAX_SPEED_LEN))
    {
        EepromPram_WritePram(E2_MAX_SPEED_ID, Buffer, E2_MAX_SPEED_LEN);
    }


    //0x0056	超速持续时间,单位为秒,DWORD,默认为10秒,九通要求立马上报
    #ifdef  HUOYUN_DEBUG_OPEN
    temp = 5;
    #else
    temp = 10;
    #endif
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_OVER_SPEED_KEEP_TIME_ID, Buffer, E2_OVER_SPEED_KEEP_TIME_LEN))
    {
        EepromPram_WritePram(E2_OVER_SPEED_KEEP_TIME_ID, Buffer, E2_OVER_SPEED_KEEP_TIME_LEN);
    }
    //0x0057	连续驾驶时间门限//单位为秒//默认为14400秒(4小时)
    temp = 14400;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_MAX_DRVIE_TIME_ID, Buffer, E2_MAX_DRVIE_TIME_LEN))
    {
        EepromPram_WritePram(E2_MAX_DRVIE_TIME_ID, Buffer, E2_MAX_DRVIE_TIME_LEN);
    }
    //0x0058	当天累计驾驶时间门限//单位为秒//默认为0xffffffff,不开启该功能
    #ifdef  HUOYUN_DEBUG_OPEN
    temp = 57600;
    #else
    temp = 0xffffffff;
    #endif
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_MAX_DRVIE_TIME_ONEDAY_ID, Buffer, E2_MAX_DRVIE_TIME_ONEDAY_LEN))
    {
        EepromPram_WritePram(E2_MAX_DRVIE_TIME_ONEDAY_ID, Buffer, E2_MAX_DRVIE_TIME_ONEDAY_LEN);
    }
    //0x0059	最小休息时间//单位为秒//默认为1200（20分钟）
    temp = 1200;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_MIN_RELAX_TIME_ID, Buffer, E2_MIN_RELAX_TIME_LEN))
    {
        EepromPram_WritePram(E2_MIN_RELAX_TIME_ID, Buffer, E2_MIN_RELAX_TIME_LEN);
    }
    //0x005A	最长停车时间//单位为秒//默认为0xffffffff,不开启该功能
    #ifdef  HUOYUN_DEBUG_OPEN
    temp = 3600;
    #else
    temp = 0xffffffff;
    #endif
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_MAX_STOP_CAR_TIME_ID, Buffer, E2_MAX_STOP_CAR_TIME_LEN))
    {
        EepromPram_WritePram(E2_MAX_STOP_CAR_TIME_ID, Buffer, E2_MAX_STOP_CAR_TIME_LEN);
    }
    //0x005B	超速报警预警差值，单位为1/10Km/h,DWORD,默认为50（5km/h）
    #ifdef  HUOYUN_DEBUG_OPEN
    temp = 100;
    #else
    temp = 50;
    #endif
    Public_ConvertShortToBuffer(temp, Buffer);//modify by joneming
    if(0 == EepromPram_WritePram(E2_SPEED_EARLY_ALARM_DVALUE_ID, Buffer, E2_SPEED_EARLY_ALARM_DVALUE_LEN))
    {
        EepromPram_WritePram(E2_SPEED_EARLY_ALARM_DVALUE_ID, Buffer, E2_SPEED_EARLY_ALARM_DVALUE_LEN);
    }
    //0x005C	疲劳驾驶预警差值，单位为秒（s），>0  默认为1800秒（30分钟）
    #ifdef  HUOYUN_DEBUG_OPEN
    temp = 1200;
    #else
    temp = 1800;
    #endif
    Public_ConvertShortToBuffer(temp, Buffer);//modify by joneming
    if(0 == EepromPram_WritePram(E2_TIRE_EARLY_ALARM_DVALUE_ID, Buffer, E2_TIRE_EARLY_ALARM_DVALUE_LEN))
    {
        EepromPram_WritePram(E2_TIRE_EARLY_ALARM_DVALUE_ID, Buffer, E2_TIRE_EARLY_ALARM_DVALUE_LEN);
    }
    //0x005D	碰撞报警参数设置,碰撞时间默认为4ms,碰撞加速度默认设置为4g
    #ifdef  HUOYUN_DEBUG_OPEN
    temp = 17924;
    #else
    temp = 0x2801;//4g,4ms
    #endif
    Public_ConvertShortToBuffer(temp, Buffer);//modify by joneming
    if(0 == EepromPram_WritePram(E2_SET_CRASH_ALARM_ID, Buffer, E2_SET_CRASH_ALARM_LEN))
    {
        EepromPram_WritePram(E2_SET_CRASH_ALARM_ID, Buffer, E2_SET_CRASH_ALARM_LEN);
    }

    //0x005E	侧翻报警参数设置：侧翻角度，单位1 度，默认为45 度
    #ifdef  HUOYUN_DEBUG_OPEN
    temp = 30;
    #else
    temp = 45;//45度,V1.01.01默认为60,V1.01.02默认为60,V1.01.03默认为30,V1.01.04版为45
    #endif
    Public_ConvertShortToBuffer(temp, Buffer);//modify by joneming
    if(0 == EepromPram_WritePram(E2_SET_ROLLOVER_ALARM_ID, Buffer, E2_SET_ROLLOVER_ALARM_LEN))
    {
        EepromPram_WritePram(E2_SET_ROLLOVER_ALARM_ID, Buffer, E2_SET_ROLLOVER_ALARM_LEN);
    }

    //0x0064	定时拍照控制,默认为不开启,值为0
    temp = 0;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_TIME_PHOTO_CONTROL_ID, Buffer, E2_TIME_PHOTO_CONTROL_LEN))
    {
        EepromPram_WritePram(E2_TIME_PHOTO_CONTROL_ID, Buffer, E2_TIME_PHOTO_CONTROL_LEN);
    }
    //0x0065	定距拍照控制,默认为不开启,值为0
    temp = 0;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_MILE_PHOTO_CONTROL_ID, Buffer, E2_MILE_PHOTO_CONTROL_LEN))
    {
        EepromPram_WritePram(E2_MILE_PHOTO_CONTROL_ID, Buffer, E2_MILE_PHOTO_CONTROL_LEN);
    }

    //0x0080,累计行驶里程清0,车辆里程表读数, 单位0.1km
    temp = 0;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_CAR_TOTAL_MILE_ID, Buffer, E2_CAR_TOTAL_MILE_LEN))
    {
        EepromPram_WritePram(E2_CAR_TOTAL_MILE_ID, Buffer, E2_CAR_TOTAL_MILE_LEN);
    }
//    GpsMile_SetPram(0);//设置累计里程为0
    //Pulse_UpdataPram();//更新脉冲累计里程,这两个函数已放在了GpsMile_SetPram里面
    //GpsMile_UpdatePram();//更新GPS累计里程

    //0x0090  GNSS 定位模式，默认为0x03 北斗定位+GPS，全国货运平台联调设置
    temp = 3;
    Buffer[0] = temp;//modify by joneming
    if(0 == EepromPram_WritePram(E2_GPS_SET_MODE_ID, Buffer, E2_GPS_SET_MODE_LEN))
    {
        EepromPram_WritePram(E2_GPS_SET_MODE_ID, Buffer, E2_GPS_SET_MODE_LEN);
    }
    //0x0091  GNSS 波特率设置，默认为0x02 19200，全国货运平台联调设置
    temp = 2;
    Buffer[0] = temp;//modify by joneming
    if(0 == EepromPram_WritePram(E2_GPS_SET_BAUD_ID, Buffer, E2_GPS_SET_BAUD_LEN))
    {
        EepromPram_WritePram(E2_GPS_SET_BAUD_ID, Buffer, E2_GPS_SET_BAUD_LEN);
    }		
    //0x0092  GNSS 模块详细定位数据输出频率，1秒，全国货运平台联调设置
    temp = 1;
    Buffer[0] = temp;//modify by joneming
    if(0 == EepromPram_WritePram(E2_GPS_SET_OUTPUT_RATE_ID, Buffer, E2_GPS_SET_OUTPUT_RATE_LEN))
    {
        EepromPram_WritePram(E2_GPS_SET_OUTPUT_RATE_ID, Buffer, E2_GPS_SET_OUTPUT_RATE_LEN);
    }	

    //0x0093  GNSS 模块详细定位数据采集频率，1秒1条，全国货运平台联调设置
    temp = 1;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_GPS_SET_GATHER_RATE_ID, Buffer, E2_GPS_SET_GATHER_RATE_LEN))
    {
        EepromPram_WritePram(E2_GPS_SET_GATHER_RATE_ID, Buffer, E2_GPS_SET_GATHER_RATE_LEN);
    }	

    //0x0094  GNSS 模块详细定位数据上传方式，0，全国货运平台联调设置
    temp = 0;
    Buffer[0] = temp;//modify by joneming
    if(0 == EepromPram_WritePram(E2_GPS_SET_UPLOAD_MODE_ID, Buffer, E2_GPS_SET_UPLOAD_MODE_LEN))
    {
        EepromPram_WritePram(E2_GPS_SET_UPLOAD_MODE_ID, Buffer, E2_GPS_SET_UPLOAD_MODE_LEN);
    }	

    //0x0095  GNSS 模块详细定位数据上传设置，0，全国货运平台联调设置
    temp = 0;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_GPS_SET_UPLOAD_VALUE_ID, Buffer, E2_GPS_SET_UPLOAD_VALUE_LEN))
    {
        EepromPram_WritePram(E2_GPS_SET_UPLOAD_VALUE_ID, Buffer, E2_GPS_SET_UPLOAD_VALUE_LEN);
    }

