nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/EepromPram.c
    //0x0100  CAN 总线通道1 采集时间间隔(ms)，0 表示不采集 ，全国货运平台联调设置
    temp = 0;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_CAN1_GATHER_TIME_ID, Buffer, E2_CAN1_GATHER_TIME_LEN))
    {
        EepromPram_WritePram(E2_CAN1_GATHER_TIME_ID, Buffer, E2_CAN1_GATHER_TIME_LEN);
    }

    //0x0101  CAN 总线通道1 上传时间间隔(s)，0 表示不上传，全国货运平台联调设置
    temp = 0;
    Public_ConvertShortToBuffer(temp, Buffer);//modify by joneming
    if(0 == EepromPram_WritePram(E2_CAN1_UPLOAD_TIME_ID, Buffer, E2_CAN1_UPLOAD_TIME_LEN))
    {
        EepromPram_WritePram(E2_CAN1_UPLOAD_TIME_ID, Buffer, E2_CAN1_UPLOAD_TIME_LEN);
    }

    //0x0102  CAN 总线通道2 采集时间间隔(ms)，0 表示不采集，全国货运平台联调设置
    temp = 0;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_CAN2_GATHER_TIME_ID, Buffer, E2_CAN2_GATHER_TIME_LEN))
    {
        EepromPram_WritePram(E2_CAN2_GATHER_TIME_ID, Buffer, E2_CAN2_GATHER_TIME_LEN);
    }

    //0x0103  CAN 总线通道2 上传时间间隔(s)，0 表示不上传，全国货运平台联调设置
    temp = 0;
    Public_ConvertShortToBuffer(temp, Buffer);//modify by joneming
    if(0 == EepromPram_WritePram(E2_CAN2_UPLOAD_TIME_ID, Buffer, E2_CAN2_UPLOAD_TIME_LEN))
    {
        EepromPram_WritePram(E2_CAN2_UPLOAD_TIME_ID, Buffer, E2_CAN2_UPLOAD_TIME_LEN);
    }
    //0x0110  CAN 总线ID 单独采集设置BYTE[8]，0表示不采集，全国货运平台联调设置
    //temp = 0;    
    //Public_ConvertLongToBuffer(temp, Buffer);
    memset(Buffer,0,8);//modify by joneming
    if(0 == EepromPram_WritePram(E2_CAN_SET_ONLY_GATHER_0_ID, Buffer, E2_CAN_SET_ONLY_GATHER_LEN))
    {
        EepromPram_WritePram(E2_CAN_SET_ONLY_GATHER_0_ID, Buffer, E2_CAN_SET_ONLY_GATHER_LEN);
    }


    //制造商ID,默认为70108
    strcpy((char *)Buffer,"70108");
    if(0 == EepromPram_WritePram(E2_MANUFACTURE_ID, Buffer, E2_MANUFACTURE_LEN))
    {
        EepromPram_WritePram(E2_MANUFACTURE_ID, Buffer, E2_MANUFACTURE_LEN);
    }

    //脉冲系数,默认为7200,dxl,2015.4.10,之前是3600
    temp =7200;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_CAR_FEATURE_COEF_ID, &Buffer[1], E2_CAR_FEATURE_COEF_LEN))
    {
        EepromPram_WritePram(E2_CAR_FEATURE_COEF_ID, &Buffer[1], E2_CAR_FEATURE_COEF_LEN);
    }

    //速度选择开关,默认为GPS速度,0x01为手动GPS,0x00为手动脉冲,0x02为自动脉冲,0x03为自动GPS
    Buffer[0] = 0x03;//dxl,2015.5.11,默认为0x03,之前为0x01
    if(0 == EepromPram_WritePram(E2_SPEED_SELECT_ID, Buffer, E2_SPEED_SELECT_LEN))
    {
        EepromPram_WritePram(E2_SPEED_SELECT_ID, Buffer, E2_SPEED_SELECT_LEN);
    }

    //默认选择车门负
    temp = 0;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_DOOR_SET_ID, Buffer, E2_DOOR_SET_LEN))
    {
        EepromPram_WritePram(E2_DOOR_SET_ID, Buffer, E2_DOOR_SET_LEN);
    }
    //恢复默认初始化设置时会清除初始安装日期写标志
    Buffer[0] = 0;
    if(0 == EepromPram_WritePram(E2_INSTALL_TIME_FLAG_ID, Buffer, E2_INSTALL_TIME_FLAG_LEN))
    {
        EepromPram_WritePram(E2_INSTALL_TIME_FLAG_ID, Buffer, E2_INSTALL_TIME_FLAG_LEN);
    }

    //ACC OFF时GPS模块默认为关 
    Buffer[0] = 0;
    if(0 == EepromPram_WritePram(E2_GPS_CONTROL_ID, Buffer, E2_GPS_CONTROL_LEN))
    {
        EepromPram_WritePram(E2_GPS_CONTROL_ID, Buffer, E2_GPS_CONTROL_LEN);
    }

    //计价器功能,默认为关
    Buffer[0] = 0;
    if(0 == EepromPram_WritePram(E2_TAXIMETER_CONTROL_ID, Buffer, E2_TAXIMETER_CONTROL_LEN))
    {
        EepromPram_WritePram(E2_TAXIMETER_CONTROL_ID, Buffer, E2_TAXIMETER_CONTROL_LEN);
    }

    IWDG_ReloadCounter();//喂狗//设置的参数较多，且可能还会调用其它更新函数，运行时间可能较长，加入喂狗



    //*****************自定义参数********************
    Buffer[0] = 1;//dxl,2015.5.27,默认背光常开，客服要求
    if(0 == EepromPram_WritePram(E2_BACKLIGHT_SELECT_ID, Buffer,E2_BACKLIGHT_SELECT_ID_LEN))
    {
        EepromPram_WritePram(E2_BACKLIGHT_SELECT_ID, Buffer,E2_BACKLIGHT_SELECT_ID_LEN);
    }
    
    //E2_PRAM_BASE_CUSTOM_ID+0x39,，自定义，夜间时间范围,BCD码,新的EGS701第1版使用,今后不再使用这个参数
    for(i=0; i<4; i++)//行标第1版才使用该参数
    {
        Buffer[i] = 0;
    }
    if(0 == EepromPram_WritePram(E2_NIGHT_TIME0_ID, Buffer, E2_NIGHT_TIME0_ID_LEN))
    {
        EepromPram_WritePram(E2_NIGHT_TIME0_ID, Buffer, E2_NIGHT_TIME0_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x3a，自定义，夜间超时驾驶门限,0表示不开启夜间模式,新的EGS701第1版使用,今后不再使用这个参数
    temp = 7200;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_NIGHT_MAX_DRVIE_TIME0_ID, Buffer, E2_NIGHT_MAX_DRVIE_TIME0_ID_LEN))
    {
        EepromPram_WritePram(E2_NIGHT_MAX_DRVIE_TIME0_ID, Buffer, E2_NIGHT_MAX_DRVIE_TIME0_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x3b，自定义，夜间限速值,新的EGS701第1版使用,今后不再使用这个参数
    temp = 255;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_NIGHT_MAX_SPEED0_ID, Buffer, E2_NIGHT_MAX_SPEED0_ID_LEN))
    {
        EepromPram_WritePram(E2_NIGHT_MAX_SPEED0_ID, Buffer, E2_NIGHT_MAX_SPEED0_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+4c	驾驶员未签到语音提醒，0为关，1为开
    Buffer[0] = 0;
    if(0 == EepromPram_WritePram(E2_UNLOGIN_TTS_PLAY_ID, Buffer, E2_UNLOGIN_TTS_PLAY_ID_LEN))
    {
        EepromPram_WritePram(E2_UNLOGIN_TTS_PLAY_ID, Buffer, E2_UNLOGIN_TTS_PLAY_ID_LEN);
    }

    //E2_PRAM_BASE_CUSTOM_ID+50，自定义，超速预警持续时间,DWORD,单位秒,默认值3
    temp = 3;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_OVERSPEED_PREALARM_KEEPTIME_ID, Buffer, E2_OVERSPEED_PREALARM_KEEPTIME_ID_LEN))
    {
        EepromPram_WritePram(E2_OVERSPEED_PREALARM_KEEPTIME_ID, Buffer, E2_OVERSPEED_PREALARM_KEEPTIME_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x51，自定义，超速预警语音,STRING,最大30字节,默认值为请控制车速
    strcpy((char *)Buffer,"请控制车速");
    BufferLen = strlen((char const *)Buffer);
    if(0 == EepromPram_WritePram(E2_OVERSPEED_PREALARM_VOICE_ID, Buffer, BufferLen))
    {
        EepromPram_WritePram(E2_OVERSPEED_PREALARM_VOICE_ID, Buffer, BufferLen);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x52，自定义，超速预警每组提示时间间隔,DWORD,单位分钟,默认值5
    temp = 5;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_OVERSPEED_PREALARM_GPROUP_TIME_ID, Buffer, E2_OVERSPEED_PREALARM_GPROUP_TIME_ID_LEN))
    {
        EepromPram_WritePram(E2_OVERSPEED_PREALARM_GPROUP_TIME_ID, Buffer, E2_OVERSPEED_PREALARM_GPROUP_TIME_ID_LEN);
    }

    //E2_PRAM_BASE_CUSTOM_ID+0x53，自定义，超速预警每组提示次数,DWORD,默认值3 
    temp = 3;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_OVERSPEED_PREALARM_NUMBER_ID, Buffer, E2_OVERSPEED_PREALARM_NUMBER_ID_LEN))
    {
        EepromPram_WritePram(E2_OVERSPEED_PREALARM_NUMBER_ID, Buffer, E2_OVERSPEED_PREALARM_NUMBER_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x54，自定义，超速预警每次提示时间间隔,DWORD,单位秒,默认值10  
    temp = 10;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_OVERSPEED_PREALARM_NUMBER_TIME_ID, Buffer, E2_OVERSPEED_PREALARM_NUMBER_TIME_ID_LEN))
    {
        EepromPram_WritePram(E2_OVERSPEED_PREALARM_NUMBER_TIME_ID, Buffer, E2_OVERSPEED_PREALARM_NUMBER_TIME_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x55，自定义，超速报警语音,STRING,最大30字节,默认值您已超速，请减速行驶
    strcpy((char *)Buffer,"您已超速，请减速行驶");
    BufferLen = strlen((char const *)Buffer);
    if(0 == EepromPram_WritePram(E2_OVERSPEED_ALARM_VOICE_ID, Buffer, BufferLen))
    {
        EepromPram_WritePram(E2_OVERSPEED_ALARM_VOICE_ID, Buffer, BufferLen);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x56，自定义，超速报警每组提示时间间隔,DWORD,单位分钟,默认值5
    temp = 5;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_OVERSPEED_ALARM_GPROUP_TIME_ID, Buffer, E2_OVERSPEED_ALARM_GPROUP_TIME_ID_LEN))
    {
        EepromPram_WritePram(E2_OVERSPEED_ALARM_GPROUP_TIME_ID, Buffer, E2_OVERSPEED_ALARM_GPROUP_TIME_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x57，自定义，超速报警每组提示次数,DWORD,默认值3 
    temp = 3;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_OVERSPEED_ALARM_NUMBER_ID, Buffer, E2_OVERSPEED_ALARM_NUMBER_ID_LEN))
    {
        EepromPram_WritePram(E2_OVERSPEED_ALARM_NUMBER_ID, Buffer, E2_OVERSPEED_ALARM_NUMBER_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x58，自定义，超速报警每次提示时间间隔,DWORD,单位秒,默认值10  
    temp = 10;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_OVERSPEED_ALARM_NUMBER_TIME_ID, Buffer, E2_OVERSPEED_ALARM_NUMBER_TIME_ID_LEN))
    {
        EepromPram_WritePram(E2_OVERSPEED_ALARM_NUMBER_TIME_ID, Buffer, E2_OVERSPEED_ALARM_NUMBER_TIME_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x59，自定义，超速报警位置上报时间间隔,DWORD,单位秒,默认值0
    temp = 0;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_OVERSPEED_ALARM_REPORT_TIME_ID, Buffer, E2_OVERSPEED_ALARM_REPORT_TIME_ID_LEN))
    {
        EepromPram_WritePram(E2_OVERSPEED_ALARM_REPORT_TIME_ID, Buffer, E2_OVERSPEED_ALARM_REPORT_TIME_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x5a，自定义，夜间时间,BYTE[14],作STRING处理,默认值全0,夜间超速使用 
    for(i=0; i<14; i++)
    {
    Buffer[i] = 0;
    }
    if(0 == EepromPram_WritePram(E2_OVERSPEED_NIGHT_TIME_ID, Buffer, E2_OVERSPEED_NIGHT_TIME_ID_LEN))
    {
        EepromPram_WritePram(E2_OVERSPEED_NIGHT_TIME_ID, Buffer, E2_OVERSPEED_NIGHT_TIME_ID_LEN);
    }

    //E2_PRAM_BASE_CUSTOM_ID+0x5b，自定义，夜间超速报警及预警百分比,DWORD,默认值80
    temp = 80;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_NIGHT_OVERSPEED_PERCENT_ID, Buffer, E2_NIGHT_OVERSPEED_PERCENT_ID_LEN))
    {
        EepromPram_WritePram(E2_NIGHT_OVERSPEED_PERCENT_ID, Buffer, E2_NIGHT_OVERSPEED_PERCENT_ID_LEN);
    }

    //E2_PRAM_BASE_CUSTOM_ID+0x5c，自定义，夜间行驶预警时间,,DWORD,单位分钟,默认值10
    temp = 10;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_NIGHT_DRIVE_PREALARM_TIME_ID, Buffer, E2_NIGHT_DRIVE_PREALARM_TIME_ID_LEN))
    {
        EepromPram_WritePram(E2_NIGHT_DRIVE_PREALARM_TIME_ID, Buffer, E2_NIGHT_DRIVE_PREALARM_TIME_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x5d，自定义，夜间行驶预警语音,STRING,最大30字节,默认值"即将进入夜间时段"
    strcpy((char *)Buffer,"即将进入夜间时段");
    BufferLen = strlen((char const *)Buffer);
    if(0 == EepromPram_WritePram(E2_NIGHT_DRIVE_PREALARM_VOICE_ID, Buffer, BufferLen))
    {
        EepromPram_WritePram(E2_NIGHT_DRIVE_PREALARM_VOICE_ID, Buffer, BufferLen);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x5e，自定义，夜间行驶预警提示时间间隔(每组),DWORD,单位分钟,默认值5
    temp = 5;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_NIGHT_DRIVE_PREALARM_GPOUP_TIME_ID, Buffer, E2_NIGHT_DRIVE_PREALARM_GPOUP_TIME_ID_LEN))
    {
        EepromPram_WritePram(E2_NIGHT_DRIVE_PREALARM_GPOUP_TIME_ID, Buffer, E2_NIGHT_DRIVE_PREALARM_GPOUP_TIME_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x5f，自定义，夜间行驶预警提示次数,,DWORD,默认值3
    temp = 3;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_NIGHT_DRIVE_PREALARM_NUMBER_ID, Buffer, E2_NIGHT_DRIVE_PREALARM_NUMBER_ID_LEN))
    {
        EepromPram_WritePram(E2_NIGHT_DRIVE_PREALARM_NUMBER_ID, Buffer, E2_NIGHT_DRIVE_PREALARM_NUMBER_ID_LEN);
    }

    //E2_PRAM_BASE_CUSTOM_ID+0x60，自定义，停车休息(禁止行驶)夜间时间,BYTE[14],作STRING处理,默认值全0
    for(i=0; i<14; i++)
    {
        Buffer[i] = 0;
    }
    if(0 == EepromPram_WritePram(E2_FORBID_DRIVE_NIGHT_TIME_ID, Buffer, E2_FORBID_DRIVE_NIGHT_TIME_ID_LEN))
    {
        EepromPram_WritePram(E2_FORBID_DRIVE_NIGHT_TIME_ID, Buffer, E2_FORBID_DRIVE_NIGHT_TIME_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x61，自定义，禁行时段到达提醒提前时间,DWORD,单位分钟,默认值30
    temp = 30;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_FORBID_DRIVE_PREALARM_TIME_ID, Buffer, E2_FORBID_DRIVE_PREALARM_TIME_ID_LEN))
    {
        EepromPram_WritePram(E2_FORBID_DRIVE_PREALARM_TIME_ID, Buffer, E2_FORBID_DRIVE_PREALARM_TIME_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x62，自定义，禁行时段到达提醒语音,STRING,最大30字节,默认值"请按规定时间停车休息"
    strcpy((char *)Buffer,"请按规定时间停车休息");
    BufferLen = strlen((char const *)Buffer);
    if(0 == EepromPram_WritePram(E2_FORBID_DRIVE_PREALARM_VOICE_ID, Buffer, BufferLen))
    {
        EepromPram_WritePram(E2_FORBID_DRIVE_PREALARM_VOICE_ID, Buffer, BufferLen);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x63，自定义，禁行时段提醒时间间隔,DWORD,单位分钟,默认值5
    temp = 5;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_FORBID_DRIVE_PREALARM_GPOUP_TIME_ID, Buffer, E2_FORBID_DRIVE_PREALARM_GPOUP_TIME_ID_LEN))
    {
        EepromPram_WritePram(E2_FORBID_DRIVE_PREALARM_GPOUP_TIME_ID, Buffer, E2_FORBID_DRIVE_PREALARM_GPOUP_TIME_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x64，自定义，禁行时段到达提醒播报的次数,DWORD,默认值3
    temp = 3;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_FORBID_DRIVE_PREALARM_NUMBER_ID, Buffer, E2_FORBID_DRIVE_PREALARM_NUMBER_ID_LEN))
    {
        EepromPram_WritePram(E2_FORBID_DRIVE_PREALARM_NUMBER_ID, Buffer, E2_FORBID_DRIVE_PREALARM_NUMBER_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x65，自定义，禁行时段到达提醒语音,STRING,最大30字节,默认值"请按规定时间停车休息"
    strcpy((char *)Buffer,"请按规定时间停车休息");
    BufferLen = strlen((char const *)Buffer);
    if(0 == EepromPram_WritePram(E2_FORBID_DRIVE_ALARM_VOICE_ID, Buffer, BufferLen))
    {
        EepromPram_WritePram(E2_FORBID_DRIVE_ALARM_VOICE_ID, Buffer, BufferLen);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x66，自定义，禁行时段提醒时间间隔,DWORD,单位分钟,默认值5
    temp = 5;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_FORBID_DRIVE_ALARM_GPOUP_TIME_ID, Buffer, E2_FORBID_DRIVE_ALARM_GPOUP_TIME_ID_LEN))
    {
        EepromPram_WritePram(E2_FORBID_DRIVE_ALARM_GPOUP_TIME_ID, Buffer, E2_FORBID_DRIVE_ALARM_GPOUP_TIME_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x67，自定义，禁行时段到达提醒播报的次数,DWORD,默认值3
    temp = 3;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_FORBID_DRIVE_ALARM_NUMBER_ID, Buffer, E2_FORBID_DRIVE_ALARM_NUMBER_ID_LEN))
    {
        EepromPram_WritePram(E2_FORBID_DRIVE_ALARM_NUMBER_ID, Buffer, E2_FORBID_DRIVE_ALARM_NUMBER_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x68，自定义，禁行时段行驶速度,单位km/h,DWORD,默认值20
    temp = 20;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_FORBID_DRIVE_RUN_SPEED_ID, Buffer, E2_FORBID_DRIVE_RUN_SPEED_ID_LEN))
    {
        EepromPram_WritePram(E2_FORBID_DRIVE_RUN_SPEED_ID, Buffer, E2_FORBID_DRIVE_RUN_SPEED_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x69，自定义，禁行时段行驶速度持续时间,单位分钟,DWORD,默认值5，
    temp = 5;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_FORBID_DRIVE_RUN_SPEED_KEEPTIME_ID, Buffer, E2_FORBID_DRIVE_RUN_SPEED_KEEPTIME_ID_LEN))
    {
        EepromPram_WritePram(E2_FORBID_DRIVE_RUN_SPEED_KEEPTIME_ID, Buffer, E2_FORBID_DRIVE_RUN_SPEED_KEEPTIME_ID_LEN);
    }
    //////////////////////
    IWDG_ReloadCounter();//喂狗//设置的参数较多，且可能还会调用其它更新函数，运行时间可能较长，加入喂狗
    ///////////////////
    //E2_PRAM_BASE_CUSTOM_ID+0x6a，自定义，夜间时间,BYTE[14],作STRING处理,默认值全0,夜间超时使用
    for(i=0; i<14; i++)
    {
        Buffer[i] = 0;
    }
    if(0 == EepromPram_WritePram(E2_TIRED_DRIVE_NIGHT_TIME_ID, Buffer, E2_TIRED_DRIVE_NIGHT_TIME_ID_LEN))
    {
        EepromPram_WritePram(E2_TIRED_DRIVE_NIGHT_TIME_ID, Buffer, E2_TIRED_DRIVE_NIGHT_TIME_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x6b，自定义，夜间连续驾驶时间门限,单位秒,DWORD,默认值7200
    temp = 7200;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_NIGHT_MAX_DRVIE_TIME_ID, Buffer, E2_NIGHT_MAX_DRVIE_TIME_ID_LEN))
    {
        EepromPram_WritePram(E2_NIGHT_MAX_DRVIE_TIME_ID, Buffer, E2_NIGHT_MAX_DRVIE_TIME_ID_LEN);
    }

    //E2_PRAM_BASE_CUSTOM_ID+0x6c，自定义，夜间最小休息时间,单位秒,DWORD,默认值1200
    temp = 1200;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_NIGHT_MIN_RELAX_TIME_ID, Buffer, E2_NIGHT_MIN_RELAX_TIME_ID_LEN))
    {
        EepromPram_WritePram(E2_NIGHT_MIN_RELAX_TIME_ID, Buffer, E2_NIGHT_MIN_RELAX_TIME_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x6d，自定义，超时驾驶报警提示语音有效时间,单位分钟,DWORD,默认值30,国标要求
    temp = 30;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_TIRED_DRIVE_ALARM_TIME_ID, Buffer, E2_TIRED_DRIVE_ALARM_TIME_ID_LEN))
    {
        EepromPram_WritePram(E2_TIRED_DRIVE_ALARM_TIME_ID, Buffer, E2_TIRED_DRIVE_ALARM_TIME_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x6e，自定义，超时驾驶预警提示语音,STRING,最大30字节,默认值请勿超时驾驶
    strcpy((char *)Buffer,"请勿超时驾驶");
    BufferLen = strlen((char const *)Buffer);
    if(0 == EepromPram_WritePram(E2_TIRED_DRIVE_PREALARM_VOICE_ID, Buffer, BufferLen))
    {
        EepromPram_WritePram(E2_TIRED_DRIVE_PREALARM_VOICE_ID, Buffer, BufferLen);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x6f，自定义，超时驾驶预警每组提示时间间隔,单位分钟,DWORD,默认值5
    temp = 5;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_TIRED_DRIVE_PREALARM_GPOUP_TIME_ID, Buffer, E2_TIRED_DRIVE_PREALARM_GPOUP_TIME_ID_LEN))
    {
        EepromPram_WritePram(E2_TIRED_DRIVE_PREALARM_GPOUP_TIME_ID, Buffer, E2_TIRED_DRIVE_PREALARM_GPOUP_TIME_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x70，自定义，超时驾驶预警每组提示次数,DWORD,默认值3
    temp = 3;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_TIRED_DRIVE_PREALARM_NUMBER_ID, Buffer, E2_TIRED_DRIVE_PREALARM_NUMBER_ID_LEN))
    {
        EepromPram_WritePram(E2_TIRED_DRIVE_PREALARM_NUMBER_ID, Buffer, E2_TIRED_DRIVE_PREALARM_NUMBER_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x71，自定义，超时驾驶预警每次提示时间间隔,单位秒,DWORD,默认值10
    temp = 10;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_TIRED_DRIVE_PREALARM_NUMBER_TIME_ID, Buffer, E2_TIRED_DRIVE_PREALARM_NUMBER_TIME_ID_LEN))
    {
        EepromPram_WritePram(E2_TIRED_DRIVE_PREALARM_NUMBER_TIME_ID, Buffer, E2_TIRED_DRIVE_PREALARM_NUMBER_TIME_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x72，自定义，超时驾驶报警提示语音,STRING,最大30字节,默认值请勿超时驾驶
    strcpy((char *)Buffer,"请勿超时驾驶");
    BufferLen = strlen((char const *)Buffer);
    if(0 == EepromPram_WritePram(E2_TIRED_DRIVE_ALARM_VOICE_ID, Buffer, BufferLen))
    {
        EepromPram_WritePram(E2_TIRED_DRIVE_ALARM_VOICE_ID, Buffer, BufferLen);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x73，自定义，超时驾驶报警每组提示时间间隔,单位分钟,DWORD,默认值5
    temp = 5;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_TIRED_DRIVE_ALARM_GPOUP_TIME_ID, Buffer, E2_TIRED_DRIVE_ALARM_GPOUP_TIME_ID_LEN))
    {
        EepromPram_WritePram(E2_TIRED_DRIVE_ALARM_GPOUP_TIME_ID, Buffer, E2_TIRED_DRIVE_ALARM_GPOUP_TIME_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x74，自定义，超时驾驶报警每组提示次数,DWORD,默认值3
    temp = 3;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_TIRED_DRIVE_ALARM_NUMBER_ID, Buffer, E2_TIRED_DRIVE_ALARM_NUMBER_ID_LEN))
    {
        EepromPram_WritePram(E2_TIRED_DRIVE_ALARM_NUMBER_ID, Buffer, E2_TIRED_DRIVE_ALARM_NUMBER_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x75，自定义，超时驾驶报警每次提示时间间隔,单位秒,DWORD,默认值10
    temp = 10;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_TIRED_DRIVE_ALARM_NUMBER_TIME_ID, Buffer, E2_TIRED_DRIVE_ALARM_NUMBER_TIME_ID_LEN))
    {
        EepromPram_WritePram(E2_TIRED_DRIVE_ALARM_NUMBER_TIME_ID, Buffer, E2_TIRED_DRIVE_ALARM_NUMBER_TIME_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x76，自定义，超时驾驶报警位置上报开启时间,单位秒,DWORD,默认值0xffffffff,不开启,九通为1200秒
    temp = 0xffffffff;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_TIRED_DRIVE_REPORT_OPEN_TIME_ID, Buffer, E2_TIRED_DRIVE_REPORT_OPEN_TIME_ID_LEN))
    {
        EepromPram_WritePram(E2_TIRED_DRIVE_REPORT_OPEN_TIME_ID, Buffer, E2_TIRED_DRIVE_REPORT_OPEN_TIME_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x77，自定义，超时驾驶报警位置上报时间间隔,单位秒,DWORD,默认值300,九通为5分钟
    temp = 0;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_TIRED_DRIVE_REPORT_TIME_ID, Buffer, E2_TIRED_DRIVE_REPORT_TIME_ID_LEN))
    {
        EepromPram_WritePram(E2_TIRED_DRIVE_REPORT_TIME_ID, Buffer, E2_TIRED_DRIVE_REPORT_TIME_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x78，自定义，超时驾驶行驶判定速度,单位km/h,DWORD,默认值0,
    temp = 20;//dxl,2014.5.13原来默认值为0现在调整为20
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_TIRED_DRIVE_RUN_SPEED_ID, Buffer, E2_TIRED_DRIVE_RUN_SPEED_ID_LEN))
    {
        EepromPram_WritePram(E2_TIRED_DRIVE_RUN_SPEED_ID, Buffer, E2_TIRED_DRIVE_RUN_SPEED_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x79，自定义，超时驾驶行驶判定持续时间,单位秒,DWORD,默认值10,
    temp = 60;//dxl,2014.5.13原来默认值为0现在调整为60
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_TIRED_DRIVE_RUN_KEEPTIME_ID, Buffer, E2_TIRED_DRIVE_RUN_KEEPTIME_ID_LEN))
    {
        EepromPram_WritePram(E2_TIRED_DRIVE_RUN_KEEPTIME_ID, Buffer, E2_TIRED_DRIVE_RUN_KEEPTIME_ID_LEN);
    }

    //E2_PRAM_BASE_CUSTOM_ID+0x7a，自定义，偏离线路 报警次数，0：不播报，255：持续播报 DWORD,默认值3
    temp = 3;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_ROUTE_EXCURSION_ALARM_NUMBER_ID, Buffer, E2_ROUTE_EXCURSION_ALARM_NUMBER_ID_LEN))
    {
        EepromPram_WritePram(E2_ROUTE_EXCURSION_ALARM_NUMBER_ID, Buffer, E2_ROUTE_EXCURSION_ALARM_NUMBER_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x7b，自定义，偏离线路报警语音时间间隔,DWORD,默认值5
    temp = 5;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_ROUTE_EXCURSION_ALARM_GPOUP_TIME_ID, Buffer, E2_ROUTE_EXCURSION_ALARM_GPOUP_TIME_ID_LEN))
    {
        EepromPram_WritePram(E2_ROUTE_EXCURSION_ALARM_GPOUP_TIME_ID, Buffer, E2_ROUTE_EXCURSION_ALARM_GPOUP_TIME_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x7c，自定义，偏离线路报警语音,STRING,最大30字节,默认值请你按规定线路行驶
    strcpy((char *)Buffer,"请你按规定线路行驶");
    BufferLen = strlen((char const *)Buffer);
    if(0 == EepromPram_WritePram(E2_ROUTE_EXCURSION_ALARM_VOICE_ID, Buffer, BufferLen))
    {
        EepromPram_WritePram(E2_ROUTE_EXCURSION_ALARM_VOICE_ID, Buffer, BufferLen);
    }
    
    temp = 0;
    Public_ConvertLongToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_REPORT_FREQ_EVENT_SWITCH_ID, Buffer, E2_REPORT_FREQ_EVENT_SWITCH_ID_LEN))
    {
        EepromPram_WritePram(E2_REPORT_FREQ_EVENT_SWITCH_ID, Buffer, E2_REPORT_FREQ_EVENT_SWITCH_ID_LEN);
    }

    //E2_PRAM_BASE_CUSTOM_ID+0x7E参数ID，自定义，行驶中禁止电话功能开关，0允许通话；1禁止通话，通用版默认为0，福建电信版默认为1
    #if (MOD_TYPE == CDMA_MODULE_MC8331) 
    Buffer[0] = 1;
    #else
    Buffer[0] = 0;
    #endif
    if(0 == EepromPram_WritePram(E2_RUN_FORBID_CALL_SWITCH_ID, Buffer, E2_RUN_FORBID_CALL_SWITCH_ID_LEN))
    {
        EepromPram_WritePram(E2_RUN_FORBID_CALL_SWITCH_ID, Buffer, E2_RUN_FORBID_CALL_SWITCH_ID_LEN);
    }
    //E2_PRAM_BASE_CUSTOM_ID+0x80参数ID，自定义，表明32pin的LED接口接的外设类型,2字节，bit0:条屏bit1:顶灯bit2:评价器bit3:载重传感器bit4-bit15:保留;相应位为1表示该端口接了相应外设。
    temp = 0;
    Public_ConvertShortToBuffer(temp, Buffer);
    if(0 == EepromPram_WritePram(E2_LED_PORT_ID, Buffer, E2_LED_PORT_ID_LEN))
    {
        EepromPram_WritePram(E2_LED_PORT_ID, Buffer, E2_LED_PORT_ID_LEN);
    }
    IWDG_ReloadCounter();//喂狗//设置的参数较多，且可能还会调用其它更新函数，运行时间可能较长，加入喂狗

