nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/EepromPram.c
}
/*********************************************************************
//函数名称	:EepromPram_DefaultSetRead(void)
//功能		:读系统第1次运行时的默认设置值
//输入		:
//输出		:
//使用资源	:
//全局变量	:   
//调用函数	:
//中断资源	:  
//返回		:
//备注		:
*********************************************************************/
void EepromPram_DefaultSetRead(void)
{
	u8	Buffer[31];
	u8	BufferLen;
	u8	flag = 0;
	
//*************通话功能参数**********************
           //接听策略

		BufferLen = EepromPram_ReadPram(E2_TERMINAL_GET_PHONE_STRATEGY_ID, Buffer);
		//flag = 0;
		if(0 == BufferLen)
		{
			flag++;
		}

	//每次最长通话时间//单位为秒//默认为0,关闭通话

		BufferLen = EepromPram_ReadPram(E2_MAX_PHONE_TIME_EACH_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	 //每月最长通话时间//单位为秒//默认为0,关闭通话
	
		BufferLen = EepromPram_ReadPram(E2_MAX_PHONE_TIME_MONTH_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}

	  //报警屏蔽字,bit9,11,12,29,30默认屏蔽
	
		BufferLen = EepromPram_ReadPram(E2_ALARM_MASK_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	  //报警发送文本SMS开关//默认为全关
	
		BufferLen = EepromPram_ReadPram(E2_ALARM_TEXT_SWITCH_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	   //报警拍摄开关//默认为紧急报警时拍摄,其它关闭
	
		BufferLen = EepromPram_ReadPram(E2_ALARM_PHOTO_SWITCH_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	   //报警拍摄存储标志//默认为全关
	
		BufferLen = EepromPram_ReadPram(E2_ALARM_PHOTO_STORE_FLAG_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	   //关键标志,没有设置关键报警
	
		BufferLen = EepromPram_ReadPram(E2_KEY_FLAG_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	
	 //当天累计驾驶时间门限//单位为秒//默认为0
	
		BufferLen = EepromPram_ReadPram(E2_MAX_DRVIE_TIME_ONEDAY_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	  //最长停车时间//单位为秒//默认为0
	
		BufferLen = EepromPram_ReadPram(E2_MAX_STOP_CAR_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	
	//制造商ID,默认为70108
	
		BufferLen = EepromPram_ReadPram(E2_MANUFACTURE_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	
	//脉冲系数,默认为3600
	
		BufferLen = EepromPram_ReadPram(E2_CAR_FEATURE_COEF_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//速度选择开关,默认为GPS速度
	
		BufferLen = EepromPram_ReadPram(E2_SPEED_SELECT_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
        //默认选择车门负
	
		BufferLen = EepromPram_ReadPram(E2_DOOR_SET_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//恢复默认初始化设置时会清除初始安装日期写标志
	
		BufferLen = EepromPram_ReadPram(E2_INSTALL_TIME_FLAG_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//ACC OFF时GPS模块默认为关 
	
		BufferLen = EepromPram_ReadPram(E2_GPS_CONTROL_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	
	//计价器功能,默认为关
     
		BufferLen = EepromPram_ReadPram(E2_TAXIMETER_CONTROL_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//累计行驶里程清0
	
		BufferLen = EepromPram_ReadPram(E2_CAR_TOTAL_MILE_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	 //碰撞报警默认为4g
	
		BufferLen = EepromPram_ReadPram(E2_SET_CRASH_ALARM_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	 //侧翻报警默认为60度
	
		BufferLen = EepromPram_ReadPram(E2_SET_ROLLOVER_ALARM_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//关闭驾驶员未签到语音提醒，0为关，1为开
	
		BufferLen = EepromPram_ReadPram(E2_UNLOGIN_TTS_PLAY_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	
//*****************超速功能相关参数********************
	//最高速度,单位km/h,DWORD,默认值130

		BufferLen = EepromPram_ReadPram(E2_MAX_SPEED_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	
	
	//超速持续时间,单位为秒,DWORD,默认为10秒
	
		BufferLen = EepromPram_ReadPram(E2_OVER_SPEED_KEEP_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	
	//超速报警预警差值，单位为1/10Km/h,DWORD,默认为50（5km/h）  
	
		BufferLen = EepromPram_ReadPram(E2_SPEED_EARLY_ALARM_DVALUE_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	
	
	//参数ID，自定义，超速预警持续时间,DWORD,单位秒,默认值3
	
		BufferLen = EepromPram_ReadPram(E2_OVERSPEED_PREALARM_KEEPTIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，超速预警语音,STRING,最大30字节,默认值为请控制车速
	
		BufferLen = EepromPram_ReadPram(E2_OVERSPEED_PREALARM_VOICE_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，超速预警每组提示时间间隔,DWORD,单位分钟,默认值5
	
		BufferLen = EepromPram_ReadPram(E2_OVERSPEED_PREALARM_GPROUP_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	
	//参数ID，自定义，超速预警每组提示次数,DWORD,默认值3 
	
		BufferLen = EepromPram_ReadPram(E2_OVERSPEED_PREALARM_NUMBER_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，超速预警每次提示时间间隔,DWORD,单位秒,默认值10  
	
		BufferLen = EepromPram_ReadPram(E2_OVERSPEED_PREALARM_NUMBER_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，超速报警语音,STRING,最大30字节,默认值您已超速，请减速行驶
	
		BufferLen = EepromPram_ReadPram(E2_OVERSPEED_ALARM_VOICE_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，超速报警每组提示时间间隔,DWORD,单位分钟,默认值5
	
		BufferLen = EepromPram_ReadPram(E2_OVERSPEED_ALARM_GPROUP_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，超速报警每组提示次数,DWORD,默认值3 
	
		BufferLen = EepromPram_ReadPram(E2_OVERSPEED_ALARM_NUMBER_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，超速报警每次提示时间间隔,DWORD,单位秒,默认值10  
	
		BufferLen = EepromPram_ReadPram(E2_OVERSPEED_ALARM_NUMBER_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，超速报警位置上报时间间隔,DWORD,单位秒,默认值0

		BufferLen = EepromPram_ReadPram(E2_OVERSPEED_ALARM_REPORT_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，夜间时间,BYTE[14],作STRING处理,默认值全0,夜间超速使用 
	
		BufferLen = EepromPram_ReadPram(E2_OVERSPEED_NIGHT_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	
		BufferLen = EepromPram_ReadPram(E2_NIGHT_TIME0_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，夜间超速报警及预警百分比,DWORD,默认值80
	
		BufferLen = EepromPram_ReadPram(E2_NIGHT_OVERSPEED_PERCENT_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	
		BufferLen = EepromPram_ReadPram(E2_NIGHT_MAX_SPEED0_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，夜间行驶预警时间,,DWORD,单位分钟,默认值10
	
		BufferLen = EepromPram_ReadPram(E2_NIGHT_DRIVE_PREALARM_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，夜间行驶预警语音,STRING,最大30字节,默认值"即将进入夜间时段"
	
