nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/EepromPram.c
		BufferLen = EepromPram_ReadPram(E2_NIGHT_DRIVE_PREALARM_VOICE_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，夜间行驶预警提示时间间隔(每组),DWORD,单位分钟,默认值5
	
		BufferLen = EepromPram_ReadPram(E2_NIGHT_DRIVE_PREALARM_GPOUP_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，夜间行驶预警提示次数,,DWORD,默认值3
	
		BufferLen = EepromPram_ReadPram(E2_NIGHT_DRIVE_PREALARM_NUMBER_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	
//****************夜间禁行功能相关参数*****************
	//参数ID，自定义，停车休息(禁止行驶)夜间时间,BYTE[14],作STRING处理,默认值全0
	
		BufferLen = EepromPram_ReadPram(E2_FORBID_DRIVE_NIGHT_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，禁行时段到达提醒提前时间,DWORD,单位分钟,默认值30
	
		BufferLen = EepromPram_ReadPram(E2_FORBID_DRIVE_PREALARM_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，禁行时段到达提醒语音,STRING,最大30字节,默认值"请按规定时间停车休息"
	
		BufferLen = EepromPram_ReadPram(E2_FORBID_DRIVE_PREALARM_VOICE_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，禁行时段提醒时间间隔,DWORD,单位分钟,默认值5
	
		BufferLen = EepromPram_ReadPram(E2_FORBID_DRIVE_PREALARM_GPOUP_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，禁行时段到达提醒播报的次数,DWORD,默认值3
	
		BufferLen = EepromPram_ReadPram(E2_FORBID_DRIVE_PREALARM_NUMBER_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，禁行时段到达提醒语音,STRING,最大30字节,默认值"请按规定时间停车休息"
	
		BufferLen = EepromPram_ReadPram(E2_FORBID_DRIVE_ALARM_VOICE_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，禁行时段提醒时间间隔,DWORD,单位分钟,默认值5
	
		BufferLen = EepromPram_ReadPram(E2_FORBID_DRIVE_ALARM_GPOUP_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，禁行时段到达提醒播报的次数,DWORD,默认值3
	
		BufferLen = EepromPram_ReadPram(E2_FORBID_DRIVE_ALARM_NUMBER_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，禁行时段行驶速度,单位km/h,DWORD,默认值20
	
		BufferLen = EepromPram_ReadPram(E2_FORBID_DRIVE_RUN_SPEED_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，禁行时段行驶速度持续时间,单位分钟,DWORD,默认值5，
	
		BufferLen = EepromPram_ReadPram(E2_FORBID_DRIVE_RUN_SPEED_KEEPTIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	
//*****************超时功能相关参数********************
	//连续驾驶时间门限//单位为秒//默认为14400秒(4小时)
	
		BufferLen = EepromPram_ReadPram(E2_MAX_DRVIE_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//最小休息时间//单位为秒//默认为1200（20分钟）
	
		BufferLen = EepromPram_ReadPram(E2_MIN_RELAX_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//疲劳驾驶预警差值，单位为秒（s），>0  默认为1800秒（30分钟）
	
		BufferLen = EepromPram_ReadPram(E2_TIRE_EARLY_ALARM_DVALUE_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，夜间时间,BYTE[14],作STRING处理,默认值全0,夜间超时使用
	
		BufferLen = EepromPram_ReadPram(E2_TIRED_DRIVE_NIGHT_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，夜间连续驾驶时间门限,单位秒,DWORD,默认值7200
	
		BufferLen = EepromPram_ReadPram(E2_NIGHT_MAX_DRVIE_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	
	
		BufferLen = EepromPram_ReadPram(E2_NIGHT_MAX_DRVIE_TIME0_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	
	//参数ID，自定义，夜间最小休息时间,单位秒,DWORD,默认值1200
	
		BufferLen = EepromPram_ReadPram(E2_NIGHT_MIN_RELAX_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，超时驾驶报警提示语音有效时间,单位分钟,DWORD,默认值30,国标要求
	
		BufferLen = EepromPram_ReadPram(E2_TIRED_DRIVE_ALARM_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，超时驾驶预警提示语音,STRING,最大30字节,默认值请勿超时驾驶

		BufferLen = EepromPram_ReadPram(E2_TIRED_DRIVE_PREALARM_VOICE_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，超时驾驶预警每组提示时间间隔,单位分钟,DWORD,默认值5
	
		BufferLen = EepromPram_ReadPram(E2_TIRED_DRIVE_PREALARM_GPOUP_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，超时驾驶预警每组提示次数,DWORD,默认值3
	
		BufferLen = EepromPram_ReadPram(E2_TIRED_DRIVE_PREALARM_NUMBER_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，超时驾驶预警每次提示时间间隔,单位秒,DWORD,默认值10
	
		BufferLen = EepromPram_ReadPram(E2_TIRED_DRIVE_PREALARM_NUMBER_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，超时驾驶报警提示语音,STRING,最大30字节,默认值请勿超时驾驶

		BufferLen = EepromPram_ReadPram(E2_TIRED_DRIVE_ALARM_VOICE_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，超时驾驶报警每组提示时间间隔,单位分钟,DWORD,默认值5
		BufferLen = EepromPram_ReadPram(E2_TIRED_DRIVE_ALARM_GPOUP_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，超时驾驶报警每组提示次数,DWORD,默认值3
	
		BufferLen = EepromPram_ReadPram(E2_TIRED_DRIVE_ALARM_NUMBER_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，超时驾驶报警每次提示时间间隔,单位秒,DWORD,默认值10
	
		BufferLen = EepromPram_ReadPram(E2_TIRED_DRIVE_ALARM_NUMBER_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，超时驾驶报警位置上报开启时间,单位秒,DWORD,默认值0xffffffff,不开启,九通为20分钟
	
		BufferLen = EepromPram_ReadPram(E2_TIRED_DRIVE_REPORT_OPEN_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，超时驾驶报警位置上报时间间隔,单位秒,DWORD,默认值300,九通为5分钟
	
		BufferLen = EepromPram_ReadPram(E2_TIRED_DRIVE_REPORT_TIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，超时驾驶行驶判定速度,单位km/h,DWORD,默认值0,

		BufferLen = EepromPram_ReadPram(E2_TIRED_DRIVE_RUN_SPEED_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
	//参数ID，自定义，超时驾驶行驶判定持续时间,单位秒,DWORD,默认值10,
	
		BufferLen = EepromPram_ReadPram(E2_TIRED_DRIVE_RUN_KEEPTIME_ID, Buffer);
		if(0 == BufferLen)
		{
			flag++;
		}
		if(0 != flag)
		{
			flag = 1;
		}
}
/*********************************************************************
//函数名称	:EepromPram_EraseAllPram(void)
//功能		:擦除所有的参数
//输入		:
//输出		:
//使用资源	:
//全局变量	:   
//调用函数	:
//中断资源	:  
//返回		:
//备注		:
*********************************************************************/
void EepromPram_EraseAllPram(void)
{
        u16   Address;
        u8    i;
        
        for(Address=E2_PRAM_START_ADDR; Address<E2_PRAM_END_ADDR; Address++)
        {
            E2prom_WriteByte(Address, 0xff);
            for(i=0; i<100; i++)
            {
            
            }
        }
}
//*************************调试用********************
/*********************************************************************
//函数名称	:EepromPram_WriteAllPram(void)
//功能		:写eeprom所有参数
//输入		:PramID:参数ID;pBuffer:指向数据（待写入的字节流,写入的是数值的话则高字节应在前）的指针;
//		:BufferLen:数据的长度
//输出		:
//使用资源	:
//全局变量	:   
//调用函数	:
//中断资源	:  
//返回		:
//备注		:写入正确时，返回的长度等于BufferLen;写入错误时，返回0,此时可尝试再调用该函数写一次
*********************************************************************/
void EepromPram_WriteAllPram(void)
{
	u8	Buffer[25] = {"abcdefghijklmnopqrstuvwxy"};
	u8	Buffer2[25];
	u16	PramID;
	u16	BufferLen;
	u16	length;
	//u8	flag = 0;
	
	for(PramID = 1; PramID < E2_PRAM_ID_INDEX_MAX; PramID++)
	{
		//flag = 0;
		BufferLen = EepromPramLength[PramID];
		EepromPram_WritePram(PramID, Buffer, BufferLen);
		length = EepromPram_ReadPram(PramID, Buffer2);
		if(length != BufferLen)
		{
			//flag = 1;
		}
		else
		{
			if(BufferLen == 0)
			{
				//flag = 1;
			}
		}
	}
}
